[
    [
        {
            "type": "story",
            "en": "The Twelve Months",
            "story": "<p>An <strong class='idiom-tip' idx='1'>awful </strong>woman lived with her daughter and stepdaughter in her <strong class='idiom-tip' idx='5'>household</strong>. She <strong class='idiom-tip' idx='14'>possessed </strong>feelings of hate for her stepdaughter, Anna. Anna worked while her stepsister did nothing. On a cold January night, Anna&rsquo;s stepmother <strong class='idiom-tip' idx='16'>remarked</strong>, &ldquo;Your stepsister <strong class='idiom-tip' idx='3'>desires </strong>flowers. Go and find some.&rdquo;</p><p>Anna wasn&rsquo;t <strong class='idiom-tip' idx='0'>anxious </strong>to walk through the chilled <strong class='idiom-tip' idx='7'>landscape</strong>. The cold air made her <strong class='idiom-tip' idx='10'>lungs </strong>burn. She walked at a slow <strong class='idiom-tip' idx='12'>pace </strong>because of the snow. Soon she saw a group of people. It <strong class='idiom-tip' idx='2'>consisted </strong>of twelve men. Anna told them about the flowers.</p><p>One of the man said they were the twelve months and that they would help Anna. January walked to her and made a <strong class='idiom-tip' idx='11'>motion </strong>with his hand. The days of the month passed <strong class='idiom-tip' idx='15'>rapidly </strong>until it was February&rsquo;s turn. February also made the month speed up. Then March made the sun <strong class='idiom-tip' idx='18'>shine </strong>and flowers grew in the field.</p><p>Anna <strong class='idiom-tip' idx='9'>loaded </strong>her basket with so many flowers that she could hardly <strong class='idiom-tip' idx='8'>lift </strong>it. Then she gave a quick but <strong class='idiom-tip' idx='13'>polite </strong>&ldquo;thank you&rdquo; to the twelve men and returned home. She was very <strong class='idiom-tip' idx='4'>eager </strong>to show her stepmother all the flowers. Back at the house, she <strong class='idiom-tip' idx='19'>spilled </strong>the flowers onto the table. Then she told her stepmother about the twelve men. Anna&rsquo;s stepmother and stepsister went to <strong class='idiom-tip' idx='17'>seek </strong>the twelve months. Their <strong class='idiom-tip' idx='6'>intent </strong>was to ask for gifts. They looked and looked. They became very lost and never found their way home. Anna lived happily by herself.</p>",
            "vi": "<p>Một người phụ nữ <strong class='idiom-tip' idx='1'>tồi tệ </strong>sống cùng con gái và con kế của mình trong <strong class='idiom-tip' idx='5'>gia đình </strong>của bà. Bà <strong class='idiom-tip' idx='14'>cảm thấy </strong>ghét con kế, Anna. Anna làm việc trong khi con gái của bà không làm gì cả. Vào một đêm lạnh giá của tháng Giêng, mẹ kế của Anna <strong class='idiom-tip' idx='16'>nhận xét</strong>, “Con gái của mẹ <strong class='idiom-tip' idx='3'>muốn </strong>hoa. Hãy đi tìm một ít.”</p><p>Anna không <strong class='idiom-tip' idx='0'>lo lắng </strong>khi phải đi qua <strong class='idiom-tip' idx='7'>cảnh vật </strong>lạnh giá. Không khí lạnh làm cho <strong class='idiom-tip' idx='10'>phổi </strong>của cô ấy đau rát. Cô đi chậm <strong class='idiom-tip' idx='12'>vì </strong>tuyết. Sớm chóng, cô thấy một nhóm người. Nó <strong class='idiom-tip' idx='2'>gồm </strong>mười hai người đàn ông. Anna nói với họ về những bông hoa.</p><p>Một trong số họ nói rằng họ là mười hai tháng và sẽ giúp Anna. Tháng Giêng tiến đến gần cô và làm một <strong class='idiom-tip' idx='11'>cử chỉ </strong>với tay. Những ngày trong tháng trôi qua <strong class='idiom-tip' idx='15'>nhanh chóng </strong>cho đến khi đến lượt tháng Hai. Tháng Hai cũng làm cho tháng trôi nhanh hơn. Sau đó, tháng Ba làm cho mặt trời <strong class='idiom-tip' idx='18'>chiếu sáng </strong>và hoa nở ra trên cánh đồng.</p><p>Anna <strong class='idiom-tip' idx='9'>đặt </strong>rổ của mình đầy hoa đến mức cô gần như không thể <strong class='idiom-tip' idx='8'>kê </strong>nó lên được. Sau đó, cô cảm ơn nhanh chóng nhưng <strong class='idiom-tip' idx='13'>lịch sự </strong>“cảm ơn” đến mười hai người đàn ông và trở về nhà. Cô rất <strong class='idiom-tip' idx='4'>hào hứng </strong>khi được cho mẹ kế xem tất cả những bông hoa. Về đến nhà, cô <strong class='idiom-tip' idx='19'>rải </strong>hoa lên bàn. Sau đó, cô kể cho mẹ kế về mười hai người đàn ông. Mẹ kế của Anna và chị kế của cô đi <strong class='idiom-tip' idx='17'>tìm </strong>mười hai tháng. Ý <strong class='idiom-tip' idx='6'>định </strong>của họ là xin quà. Họ tìm mãi và tìm mãi. Họ bị lạc và không bao giờ tìm được đường về nhà. Anna sống hạnh phúc một mình.</p>",
            "image": "25011.jpg",
            "sound": "25011.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li answer-index='1' class='answer-the-questions-section'>What is this story about?<ul class='ul-choose-answer'><li>a. Why a year consists of twelve months</li><li>b. How a girl made the sun shine in winter</li><li>c. Why moving at a slow pace is good</li><li>d. How the months helped a polite girl</li></ul></li><li answer-index='3' class='answer-the-questions-section'>Why did Anna need to seek flowers?<ul class='ul-choose-answer'><li>a. Her stepmother remarked that she liked them.</li><li>b. Her awful stepsister desired them for her birthday.</li><li>c. She spilled the ones she already possessed.</li><li>d. She was eager to please her stepmother.</li></ul></li><li answer-index='2' class='answer-the-questions-section'>In paragraph 4 we can infer that __________.<ul class='ul-choose-answer'><li>a. the months rapidly helped Anna load her basket</li><li>b. Anna asked the months to live in her household</li><li>c. Anna&rsquo;s awful stepmother and stepsister never found the months</li><li>d. Anna got lost going across the dark landscape on her way home</li></ul></li><li answer-index='1' class='answer-the-questions-section'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the cold air hurt Anna&rsquo;s lungs</li><li>b. Anna&rsquo;s stepmother lifted the basket</li><li>c. January made a motion to speed up time</li><li>d. Anna wasn&rsquo;t anxious to go out in the cold, dark night</li></ul></li><li class='answer-the-questions-textarea' value='They wanted to ask the Twelve Months for gifts.'>What was Anna&rsquo;s stepmother&rsquo;s and stepsister&rsquo;s intent when they left?<br />_____________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>They wanted to ask the Twelve Months for gifts.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Dragon",
            "story": "<p>An evil dragon lived in a <strong class='idiom-tip' idx='1'>castle </strong>in the <strong class='idiom-tip' idx='11'>remote</strong> <strong class='idiom-tip' idx='12'>southern </strong>mountains.</p><p>One day the <strong class='idiom-tip' idx='9'>monster</strong> <strong class='idiom-tip' idx='7'>landed </strong>in a town. The dragon <strong class='idiom-tip' idx='2'>commanded </strong>the people, &ldquo;Give me food now, or I will eat you!&rdquo; The dragon lifted its <strong class='idiom-tip' idx='19'>wings </strong>so that its lungs could be completely filled with hot <strong class='idiom-tip' idx='14'>steam</strong>, and breathed it upon the people. A man turned into a stone <strong class='idiom-tip' idx='13'>statue</strong>!</p><p>The people <strong class='idiom-tip' idx='15'>submitted </strong>and brought food. The dragon ate all of it and left.</p><p>The people sent a boy to ask for help from a wise old man. He resided in a <strong class='idiom-tip' idx='16'>temple</strong>.</p><p>The boy told the old man about the dragon. Then, the old man <strong class='idiom-tip' idx='3'>counseled </strong>the boy. &ldquo;A <strong class='idiom-tip' idx='8'>meteor </strong>will fall in the <strong class='idiom-tip' idx='10'>northern </strong>sky. It will make a huge <strong class='idiom-tip' idx='5'>explosion</strong>. Find the meteor and <strong class='idiom-tip' idx='0'>bring </strong>it to me. I will use it to make a sword for you.&rdquo;</p><p>The boy did as the old man said. Soon, the sword was ready.</p><p>&ldquo;Use this to kill the dragon. But be careful. You must cover yourself with <strong class='idiom-tip' idx='18'>weeds </strong>that smell bad. That will <strong class='idiom-tip' idx='4'>ensure </strong>that he does not smell you,&rdquo; the man said.</p><p>The boy traveled for many days to find the castle. He went to the <strong class='idiom-tip' idx='17'>upper </strong>level and opened a door. He could see the dragon&rsquo;s tail. It was sleeping, so the boy killed it. Then, he took the dragon&rsquo;s gold and <strong class='idiom-tip' idx='6'>jewelry </strong>and returned to his town. The people were happy.</p>",
            "vi": "<p>Một con rồng độc ác sống trong một <strong class='idiom-tip' idx='1'>lâu đài</strong> ở những ngọn núi <strong class='idiom-tip' idx='12'>phía nam</strong> xa xôi.</p><p>Vào một ngày, con <strong class='idiom-tip' idx='9'>quái vật</strong> <strong class='idiom-tip' idx='7'>hạ cánh</strong> xuống một thị trấn. Con rồng <strong class='idiom-tip' idx='2'>ra lệnh</strong> cho người dân, “Cho ta thức ăn ngay, nếu không ta sẽ ăn thịt các ngươi!” Con rồng giang rộng <strong class='idiom-tip' idx='19'>cánh</strong> để phổi của nó có thể đầy hơi <strong class='idiom-tip' idx='14'>nóng</strong>, và thở hơi đó lên người dân. Một người đàn ông biến thành một bức <strong class='idiom-tip' idx='13'>tượng đá</strong>!</p><p>Người dân <strong class='idiom-tip' idx='15'>đầu hàng</strong> và mang thức ăn đến. Con rồng ăn hết tất cả và rời đi.</p><p>Người dân đã cử một cậu bé đến nhờ sự giúp đỡ của một ông lão khôn ngoan. Ông sống trong một <strong class='idiom-tip' idx='16'>chùa</strong>.</p><p>Cậu bé kể cho ông lão về con rồng. Sau đó, ông lão <strong class='idiom-tip' idx='3'>khuyên</strong> cậu bé, “Một <strong class='idiom-tip' idx='8'>mảnh thiên thạch</strong> sẽ rơi xuống bầu trời <strong class='idiom-tip' idx='10'>phía bắc</strong>. Nó sẽ tạo ra một <strong class='idiom-tip' idx='5'>vụ nổ</strong> lớn. Tìm mảnh thiên thạch và <strong class='idiom-tip' idx='0'>mang</strong> nó đến cho ta. Ta sẽ sử dụng nó để làm một thanh kiếm cho ngươi.”</p><p>Cậu bé đã làm theo lời ông lão. Chẳng bao lâu, thanh kiếm đã sẵn sàng.</p><p>“Sử dụng thanh kiếm này để giết con rồng. Nhưng hãy cẩn thận. Ngươi phải phủ lên mình bằng <strong class='idiom-tip' idx='18'>cỏ dại</strong> có mùi hôi. Điều đó sẽ <strong class='idiom-tip' idx='4'>đảm bảo</strong> rằng nó không ngửi thấy mùi của ngươi,” ông lão nói.</p><p>Cậu bé đã đi nhiều ngày để tìm lâu đài. Cậu lên <strong class='idiom-tip' idx='17'>tầng trên</strong> và mở một cánh cửa. Cậu thấy đuôi của con rồng. Nó đang ngủ, vì vậy cậu đã giết nó. Sau đó, cậu lấy vàng và <strong class='idiom-tip' idx='6'>vàng bạc</strong> của con rồng và trở về thị trấn của mình. Người dân rất vui mừng.</p>",
            "image": "25050.jpg",
            "sound": "25050.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. How a dragon met a boy</li><li>b. Why dragons live in castles</li><li>c. Why a boy killed an evil dragon</li><li>d. How a boy found a remote place</li></ul></li><li class='answer-the-questions-section' answer-index='0'>How did the dragon turn the people into statues?<ul class='ul-choose-answer'><li>a. It breathed steam on them.</li><li>b. It hit them with its wings.</li><li>c. It covered them with weeds.</li><li>d. It touched them with its tail.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>What can be assumed about the old man?<ul class='ul-choose-answer'><li>a. He enjoyed commanding the townspeople.</li><li>b. He resided in the temple all his life.</li><li>c. Other dragons submitted to him in the past.</li><li>d. He counseled the townspeople when they had trouble.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>According to the passage, all of the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. a meteor fell in the northern sky</li><li>b. a boy killed the dragon with a golden sword</li><li>c. a boy took the dragon&rsquo;s jewelry</li><li>d. a dragon lived in the southern mountains</li></ul></li><li class='answer-the-questions-textarea' value='The boy covered himself with weeds to hide his smell.'>How did the boy ensure that the dragon would not smell him? <br />_____________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>b</li><li class='answer-key'>The boy covered himself with weeds to hide his smell.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Battle of Thermopylae",
            "story": "<p>This is a true story. It happened long ago in Greece....</p><p>&ldquo;We must fight,&rdquo; the Spartan* <strong class='idiom-tip' idx='4'>chief </strong>told his small army of <strong class='idiom-tip' idx='3'>brave </strong>men. They were at a great <strong class='idiom-tip' idx='5'>disadvantage</strong>. There were only three hundred of them. The Persian <strong class='idiom-tip' idx='12'>military </strong>had hundreds of thousands of men.</p><p>They were going to lose <strong class='idiom-tip' idx='18'>unless </strong>they could <strong class='idiom-tip' idx='14'>secure </strong>a small <strong class='idiom-tip' idx='7'>entrance</strong>. The <strong class='idiom-tip' idx='6'>enemy </strong>couldn&rsquo;t move through it easily. They <strong class='idiom-tip' idx='9'>intended </strong>to stop the enemy here. The chief and his men got ready for the <strong class='idiom-tip' idx='1'>battle</strong>.</p><p>Soon, long lines of the enemy&rsquo;s army <strong class='idiom-tip' idx='17'>twisted </strong>around the hills. The chief met the enemy with <strong class='idiom-tip' idx='10'>laughter</strong>. He knew that his men&rsquo;s <strong class='idiom-tip' idx='19'>weapons </strong>and skills were better. The Spartans <strong class='idiom-tip' idx='16'>trusted </strong>their leader and <strong class='idiom-tip' idx='13'>obeyed </strong>him.</p><p>First, the enemy soldiers shot <strong class='idiom-tip' idx='0'>arrows </strong>from their <strong class='idiom-tip' idx='2'>bows</strong>. The chief told his men to lift their shields*. The arrows stuck into the shields but did not hurt any of the men.</p><p>Then the enemy&rsquo;s soldiers attacked the Spartans with long spears. The chief surprised them. His troops rolled <strong class='idiom-tip' idx='11'>logs </strong>down on the enemy.</p><p>They fought for three days. Though they <strong class='idiom-tip' idx='8'>hardly </strong>slept at all, the chief and his men remained <strong class='idiom-tip' idx='15'>steady</strong>.</p><p>But the enemy found a way to beat the Spartans. The chief and all of his men were killed. Even though they lost, the Battle of Thermopylae is one of the most famous battles in history.<br />&nbsp;</p><p><em>* Spartan - a soldier from the city of Sparta in Greece</em></p><p><em>* shield - a piece of wood or metal that soldiers carried to protect themselves</em></p>",
            "vi": "<p>Đây là một câu chuyện có thật. Nó xảy ra cách đây rất lâu ở Hy Lạp....</p><p>&ldquo;Chúng ta phải chiến đấu,&rdquo; viên <strong class='idiom-tip' idx='4'>tướng </strong> Spartan* nói với đội quân nhỏ bé của mình. Họ đang ở trong một tình thế <strong class='idiom-tip' idx='5'>bất lợi</strong> lớn. Chỉ có ba trăm người. Còn quân đội Ba Tư <strong class='idiom-tip' idx='12'>có </strong> hàng trăm ngàn người.</p><p>Họ sẽ thua <strong class='idiom-tip' idx='18'>trừ khi </strong> họ có thể <strong class='idiom-tip' idx='14'>bảo vệ</strong> một <strong class='idiom-tip' idx='7'>lối vào</strong> nhỏ. Kẻ <strong class='idiom-tip' idx='6'>thù</strong> không thể di chuyển qua đó dễ dàng. Họ <strong class='idiom-tip' idx='9'>dự định</strong> dừng kẻ thù tại đây. Viên tướng và các chiến binh của ông chuẩn bị cho <strong class='idiom-tip' idx='1'>trận chiến</strong>.</p><p>Rất nhanh chóng, các đội quân của kẻ thù <strong class='idiom-tip' idx='17'>uốn cong</strong> quanh những ngọn đồi. Viên tướng đối mặt với kẻ thù bằng <strong class='idiom-tip' idx='10'>tiếng cười</strong>. Ông biết rằng vũ khí và kỹ năng của quân đội ông tốt hơn. Các chiến binh Spartan <strong class='idiom-tip' idx='16'>tin tưởng</strong> vào lãnh đạo của mình và <strong class='idiom-tip' idx='13'>tuân lệnh</strong> ông.</p><p>Đầu tiên, các binh sĩ kẻ thù bắn <strong class='idiom-tip' idx='0'>mũi tên</strong> từ <strong class='idiom-tip' idx='2'>cung</strong> của họ. Viên tướng bảo các chiến binh của ông nâng khiên*. Những mũi tên dính vào khiên nhưng không làm tổn thương bất kỳ ai.</p><p>Sau đó, các binh sĩ kẻ thù tấn công quân Spartan bằng những cây giáo dài. Viên tướng làm họ ngạc nhiên. Đội quân của ông lăn <strong class='idiom-tip' idx='11'>khúc gỗ</strong> xuống kẻ thù.</p><p>Họ chiến đấu suốt ba ngày. Dù <strong class='idiom-tip' idx='8'>hầu như</strong> không ngủ được, viên tướng và các chiến binh của ông vẫn giữ được <strong class='idiom-tip' idx='15'>vững vàng</strong>.</p><p>Nhưng kẻ thù đã tìm ra cách để đánh bại quân Spartan. Viên tướng và tất cả các chiến binh của ông đã bị giết. Dù thất bại, trận chiến Thermopylae vẫn là một trong những trận đánh nổi tiếng nhất trong lịch sử.<br />&nbsp;</p><p><em>* Spartan - một người lính đến từ thành phố Sparta ở Hy Lạp</em></p><p><em>* khiên - một mảnh gỗ hoặc kim loại mà các chiến binh cầm để bảo vệ bản thân</em></p>",
            "image": "25077.jpg",
            "sound": "25077.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. How an enemy made an attack against shields</li><li>b. Why logs were rolled down on soldiers</li><li>c. How a small disadvantaged army nearly beat a large military</li><li>d. Why good soldiers obey their leaders</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why was the smaller army not afraid of the larger one<ul class='ul-choose-answer'><li>a. The larger army didn&rsquo;t have any weapons.</li><li>b. The smaller army had better weapons and skills.</li><li>c. The larger army did not trust their leader.</li><li>d. The smaller army did not intend to fight.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>The brave men knew they would lose __________.<ul class='ul-choose-answer'><li>a. because they heard the soldiers&rsquo; laughter</li><li>b. unless they secured the narrow entrance</li><li>c. against the other army&rsquo;s bows and arrows</li><li>d. hardly any men fighting the large army</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true about the Persian army EXCEPT __________.<ul class='ul-choose-answer'><li>a. their long lines of soldiers twisted around the hills</li><li>b. they used bows and arrows</li><li>c. they had a steady three-day attack against the Spartans</li><li>d. they used fire to defeat the Spartans</li></ul></li><li class='answer-the-questions-textarea' value='The soldiers did whatever the chief asked them because they trusted and obeyed their leader.'>Why did the soldiers do whatever their chief asked of them? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>The soldiers did whatever the chief asked them because they trusted and obeyed their leader.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Deer and His Image",
            "story": "<p>A deer told himself every day, &ldquo;I am the most handsome deer in the forest. My large <strong class='idiom-tip' idx='0'>chest </strong>is a symbol of my power. And my beautiful horns <strong class='idiom-tip' idx='7'>impress </strong>other animals.&rdquo;</p><p>But he did not like his legs and hooves*. &ldquo;My legs are <strong class='idiom-tip' idx='9'>narrow</strong>, and my hooves are ugly. They do not <strong class='idiom-tip' idx='12'>satisfy </strong>me.&rdquo;</p><p>One day, the deer saw a big dog. The deer made some noise and <strong class='idiom-tip' idx='4'>disturbed </strong>the dog. The dog woke up and chased him. The deer felt <strong class='idiom-tip' idx='17'>terror</strong>. He <strong class='idiom-tip' idx='13'>screamed</strong>. He did not want to be a <strong class='idiom-tip' idx='19'>victim</strong>, so he ran into the forest. His strong legs helped him run fast. His <strong class='idiom-tip' idx='10'>pale </strong>brown hooves were hard, so they were not <strong class='idiom-tip' idx='14'>sensitive </strong>to rough rocks. However, his horns got caught in branches, slowing him down. His large chest could not fit between thick trees.</p><p>The deer <strong class='idiom-tip' idx='5'>estimated </strong>that he ran for an hour. He felt like he was running a <strong class='idiom-tip' idx='8'>marathon</strong>. In the end, the deer escaped the <strong class='idiom-tip' idx='18'>threat </strong>of the dog. He sat in the <strong class='idiom-tip' idx='15'>shade </strong>of a tree. &ldquo;That was almost a <strong class='idiom-tip' idx='3'>disaster</strong>! I almost did not escape because of my chest and horns. My legs and hooves saved me.&rdquo; As a <strong class='idiom-tip' idx='2'>consequence</strong>, the deer learned to <strong class='idiom-tip' idx='6'>honor </strong>his fast legs and have <strong class='idiom-tip' idx='1'>confidence </strong>in his strong hooves. &ldquo;Pretty things only <strong class='idiom-tip' idx='16'>supplement </strong>important things,&rdquo; he thought.<br />&nbsp;</p><p><em>*hooves - the feet of animals like deer and horses</em></p>",
            "vi": "<p>Một con hươu tự nhủ mỗi ngày, &ldquo;Tôi là con hươu đẹp nhất trong rừng. Bộ <strong class='idiom-tip' idx='0'>ngực</strong> lớn của tôi là biểu tượng của sức mạnh. Và cặp sừng đẹp của tôi <strong class='idiom-tip' idx='7'>gây ấn tượng </strong> với các loài động vật khác.&rdquo;</p><p>Nhưng nó không thích đôi chân và móng guốc* của mình. &ldquo;Chân của tôi <strong class='idiom-tip' idx='9'>hẹp</strong>, và móng guốc của tôi thì xấu xí. Chúng không <strong class='idiom-tip' idx='12'>làm tôi hài lòng</strong>.&rdquo;</p><p>Một ngày nọ, con hươu thấy một con chó lớn. Con hươu làm tiếng ồn và <strong class='idiom-tip' idx='4'>quấy rối</strong> con chó. Con chó tỉnh dậy và đuổi theo nó. Con hươu cảm thấy <strong class='idiom-tip' idx='17'>hoảng sợ</strong>. Nó <strong class='idiom-tip' idx='13'>hét lên</strong>. Nó không muốn trở thành một <strong class='idiom-tip' idx='19'>nạn nhân</strong>, vì vậy nó chạy vào trong rừng. Đôi chân mạnh mẽ của nó giúp nó chạy nhanh. Móng guốc màu nâu <strong class='idiom-tip' idx='10'>nhạt </strong> của nó cứng, nên chúng không <strong class='idiom-tip' idx='14'>nhạy cảm</strong> với những viên đá thô ráp. Tuy nhiên, sừng của nó bị mắc vào cành cây, làm chậm tốc độ của nó. Bộ ngực lớn của nó không thể lọt qua những cây cối dày đặc.</p><p>Con hươu <strong class='idiom-tip' idx='5'>ước lượng</strong> rằng nó đã chạy trong một giờ. Nó cảm thấy như đang chạy một <strong class='idiom-tip' idx='8'>cuộc thi marathon</strong>. Cuối cùng, con hươu đã thoát khỏi <strong class='idiom-tip' idx='18'>mối đe dọa</strong> của con chó. Nó ngồi dưới <strong class='idiom-tip' idx='15'>bóng râm</strong> của một cái cây. &ldquo;Thật suýt chút nữa là một <strong class='idiom-tip' idx='3'>thảm họa</strong>! Tôi suýt không thoát được vì bộ ngực và sừng của mình. Đôi chân và móng guốc của tôi đã cứu tôi.&rdquo; Vì vậy, con hươu đã học cách <strong class='idiom-tip' idx='6'>tôn trọng</strong> đôi chân nhanh nhẹn của nó và tin tưởng vào móng guốc mạnh mẽ của nó. &ldquo;Những thứ đẹp đẽ chỉ là <strong class='idiom-tip' idx='16'>bổ sung</strong> cho những thứ quan trọng,&rdquo; nó nghĩ.<br />&nbsp;</p><p><em>*móng guốc - chân của các loài động vật như hươu và ngựa</em></p>",
            "image": "25103.jpg",
            "sound": "25103.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. Why a chest is a symbol of power</li><li>b. How a deer becomes a victim</li><li>c. Why deer have confidence in their horns</li><li>d. How a deer learned to honor useful things</li></ul></li><li class='answer-the-questions-section' answer-index='0'>Why did the deer scream?<ul class='ul-choose-answer'><li>a. He felt great terror.</li><li>b. He was sensitive.</li><li>c. He ran a marathon.</li><li>d. His legs were narrow.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What can we infer by the end of the story?<ul class='ul-choose-answer'><li>a. The deer impressed the animals with his long run.</li><li>b. The deer was a victim of disaster.</li><li>c. The deer&rsquo;s legs and hooves satisfied him.</li><li>d. The deer went back to disturb the dog again.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the deer&rsquo;s hooves were pale</li><li>b. the deer sat in the shade of a tree</li><li>c. the deer experienced a bad consequence</li><li>d. the rough rocks decorated the forest</li></ul></li><li class='answer-the-questions-textarea' value='They kept getting caught in trees.'>What happened to the deer&rsquo;s horns when he ran away? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>c</li><li class='answer-key'>They kept getting caught in trees.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "May 29,1953",
            "story": "<p>Today is the most important day of my life. I finally climbed Mt. Everest, the tallest mountain in the world.</p><p>The top of the mountain was amazing. It felt like we were close to <strong class='idiom-tip' idx='6'>heaven</strong>. The snow was so thick that my <strong class='idiom-tip' idx='2'>boots</strong> <strong class='idiom-tip' idx='15'>sank</strong>. The air was <strong class='idiom-tip' idx='14'>silent</strong>. I looked at the beauty that <strong class='idiom-tip' idx='17'>surrounded </strong>me. Maybe my story will be a <strong class='idiom-tip' idx='8'>legend </strong>someday.</p><p>I want people to remember this forever. I was the <strong class='idiom-tip' idx='13'>senior </strong>explorer in my group, and I knew we needed proof of our climb. I took many pictures with my camera. I&rsquo;ll put them in a <strong class='idiom-tip' idx='5'>frame </strong>and hang them.</p><p>On the mountain, the air was very cold. I <strong class='idiom-tip' idx='19'>wrapped </strong>my coat around my body. I looked over the side of the mountaintop. From that <strong class='idiom-tip' idx='1'>angle</strong>, I saw the <strong class='idiom-tip' idx='3'>border </strong>of the clouds touch the rocks below. The snow was <strong class='idiom-tip' idx='18'>thick</strong>. It looked pure. There was no sign of modern life. Thousands of years ago, my <strong class='idiom-tip' idx='0'>ancestors </strong>saw the world this way.</p><p>After fifteen minutes, I knew it was time to <strong class='idiom-tip' idx='10'>proceed </strong>down the mountain. The whole team <strong class='idiom-tip' idx='4'>congratulated </strong>us. My <strong class='idiom-tip' idx='16'>superior</strong>, John Hunt, <strong class='idiom-tip' idx='9'>praised </strong>us all. I sent messages to my <strong class='idiom-tip' idx='12'>relatives </strong>to tell them that I was safe. But it was hard to leave the mountain so quickly. I wanted to enjoy the <strong class='idiom-tip' idx='7'>incredible</strong> sight even longer.</p>",
            "vi": "<p>Hôm nay là ngày quan trọng nhất trong đời tôi. Tôi cuối cùng đã chinh phục được đỉnh núi Everest, ngọn núi cao nhất thế giới.</p><p>Đỉnh núi thật tuyệt vời. Cảm giác như chúng tôi đang gần <strong class='idiom-tip' idx='6'>thiên đường</strong>. Tuyết dày đến mức đôi <strong class='idiom-tip' idx='2'>giày</strong> của tôi <strong class='idiom-tip' idx='15'>lún</strong>. Không khí rất <strong class='idiom-tip' idx='14'>im lặng</strong>. Tôi nhìn ngắm vẻ đẹp <strong class='idiom-tip' idx='17'>bao quanh</strong> mình. Có thể câu chuyện của tôi sẽ trở thành một <strong class='idiom-tip' idx='8'>huyền thoại</strong> nào đó trong tương lai.</p><p>Tôi muốn mọi người nhớ mãi điều này. Tôi là <strong class='idiom-tip' idx='13'>người dẫn đầu </strong> trong nhóm của mình, và tôi biết chúng tôi cần chứng minh về cuộc leo núi của mình. Tôi đã chụp nhiều bức ảnh bằng máy ảnh của mình. Tôi sẽ đặt chúng vào một <strong class='idiom-tip' idx='5'>khung </strong> và treo chúng lên.</p><p>Trên núi, không khí rất lạnh. Tôi <strong class='idiom-tip' idx='19'>quấn</strong> áo khoác quanh cơ thể mình. Tôi nhìn xuống bên mép đỉnh núi. Từ <strong class='idiom-tip' idx='1'>góc nhìn</strong> đó, tôi thấy <strong class='idiom-tip' idx='3'>biên giới</strong> của những đám mây chạm vào các tảng đá bên dưới. Tuyết rất <strong class='idiom-tip' idx='18'>dày</strong>. Nó trông tinh khiết. Không có dấu hiệu của cuộc sống hiện đại. Hàng ngàn năm trước, tổ tiên của tôi đã nhìn thế giới theo cách này.</p><p>Sau mười lăm phút, tôi biết đã đến lúc <strong class='idiom-tip' idx='10'>tiến hành</strong> xuống núi. Toàn đội <strong class='idiom-tip' idx='4'>chúc mừng</strong> chúng tôi. <strong class='idiom-tip' idx='16'>Người lãnh đạo</strong> của tôi, John Hunt, <strong class='idiom-tip' idx='9'>khen ngợi</strong> tất cả chúng tôi. Tôi đã gửi tin nhắn cho các <strong class='idiom-tip' idx='12'>người thân</strong> của mình để thông báo rằng tôi đã an toàn. Nhưng thật khó để rời núi nhanh như vậy. Tôi muốn thưởng thức cảnh tượng <strong class='idiom-tip' idx='7'>tuyệt vời</strong> này lâu hơn.</p>",
            "image": "25130.jpg",
            "sound": "25130.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='0'>What is this story about?<ul class='ul-choose-answer'><li>a. Edmund Hillary&rsquo;s incredible experience</li><li>b. The lives of Edmund Hillary&rsquo;s ancestors</li><li>c. The legend of Mt. Everest</li><li>d. How to use a camera when surrounded by snow</li></ul></li><li class='answer-the-questions-section' answer-index='3'>What did Hillary see from the angle over the side of the mountaintop?<ul class='ul-choose-answer'><li>a. The sun in the east</li><li>b. His boots on the rocks below</li><li>c. His picture in a frame</li><li>d. The border of the clouds touching the rocks</li></ul></li><li class='answer-the-questions-section' answer-index='0'>Hillary was happy to do all of the following EXCEPT __________.<ul class='ul-choose-answer'><li>a. proceed down the mountain</li><li>b. get praise from his superior</li><li>c. hear his team congratulate him</li><li>d. send messages to his relatives</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, the air at the top of the mountain was __________.<ul class='ul-choose-answer'><li>a. silent</li><li>b. thick</li><li>c. pure</li><li>d. senior</li></ul></li><li class='answer-the-questions-textarea' value='He wrapped his coat around himself because the air was very cold on the mountain.'>Why did Hillary wrap his coat tightly around himself? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>He wrapped his coat around himself because the air was very cold on the mountain.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Frog Prince",
            "story": "<p>A <strong class='idiom-tip' idx='12'>lovely </strong>princess sat by the pool and played with a <strong class='idiom-tip' idx='17'>sculpture </strong>of a bear. Suddenly, she dropped it, and it rolled away. She <strong class='idiom-tip' idx='4'>chased </strong>it, but it fell into the water. She began to cry. A large, ugly frog asked, &ldquo;Why are you crying?&rdquo; After the princess told him, the frog said, &ldquo;I can get the sculpture. What will you give me in <strong class='idiom-tip' idx='7'>exchange </strong>for the <strong class='idiom-tip' idx='8'>favor</strong>?&rdquo;</p><p>&ldquo;I can pay you a <strong class='idiom-tip' idx='9'>fee </strong>in gold,&rdquo; she said.</p><p>But the frog <strong class='idiom-tip' idx='16'>protested</strong>. &ldquo;I want to sleep in your bed, and you must kiss me in the morning.&rdquo;</p><p>&ldquo;He&rsquo;d die without water. So, I don&rsquo;t have to keep my promise,&rdquo; she thought.</p><p>The frog <strong class='idiom-tip' idx='6'>dove </strong>for a <strong class='idiom-tip' idx='3'>brief </strong>moment and got the sculpture. Then the princess ran away with it. Later, the frog went to the <strong class='idiom-tip' idx='14'>palace</strong>. The king told her to keep her promise. This put the princess in a bad <strong class='idiom-tip' idx='13'>mood</strong>. She <strong class='idiom-tip' idx='15'>permitted </strong>the frog to sleep on her pillow. In the morning, she gave him a kiss.</p><p>Suddenly, he turned into a <strong class='idiom-tip' idx='11'>guy</strong>. He said, &ldquo;I&rsquo;m from a kingdom <strong class='idiom-tip' idx='0'>abroad</strong>. In my <strong class='idiom-tip' idx='19'>youth</strong>, I <strong class='idiom-tip' idx='1'>angered </strong>a <strong class='idiom-tip' idx='18'>tribe </strong>of cruel witches, who turned me into a frog.&rdquo;</p><p>The princess asked him, &ldquo;Can I be your <strong class='idiom-tip' idx='2'>bride </strong>and stay with you <strong class='idiom-tip' idx='10'>forever</strong>?&rdquo; But the prince said, &ldquo;No. You <strong class='idiom-tip' idx='5'>disappointed </strong>me. You didn&rsquo;t keep your promise.&rdquo;</p>",
            "vi": "<p>Một công chúa <strong class='idiom-tip' idx='12'>đáng yêu</strong> ngồi bên hồ bơi và chơi với một <strong class='idiom-tip' idx='17'>tượng</strong> của một con gấu. Đột nhiên, cô làm rơi nó và nó lăn đi. Cô <strong class='idiom-tip' idx='4'>đuổi theo</strong> nó, nhưng nó rơi vào nước. Cô bắt đầu khóc. Một con ếch lớn và xấu xí hỏi, &ldquo;Tại sao cô lại khóc?&rdquo; Sau khi công chúa kể cho nó, con ếch nói, &ldquo;Tôi có thể lấy lại tượng đó. Cô sẽ cho tôi điều gì <strong class='idiom-tip' idx='7'>đổi lại</strong> cho <strong class='idiom-tip' idx='8'>ân huệ</strong>?&rdquo;</p><p>&ldquo;Tôi có thể trả cho anh một <strong class='idiom-tip' idx='9'>khoản phí</strong> bằng vàng,&rdquo; cô nói.</p><p>Nhưng con ếch <strong class='idiom-tip' idx='16'>phản đối</strong>. &ldquo;Tôi muốn ngủ trên giường của cô, và cô phải hôn tôi vào buổi sáng.&rdquo;</p><p>&ldquo;Nó sẽ chết nếu không có nước. Vì vậy, tôi không cần phải giữ lời hứa của mình,&rdquo; cô nghĩ.</p><p>Con ếch <strong class='idiom-tip' idx='6'>nhảy xuống</strong> trong một <strong class='idiom-tip' idx='3'>chốc lát</strong> và lấy lại được tượng. Sau đó, công chúa chạy trốn với nó. Sau đó, con ếch đến <strong class='idiom-tip' idx='14'>cung điện</strong>. Nhà vua bảo cô phải giữ lời hứa. Điều này làm công chúa cảm thấy <strong class='idiom-tip' idx='13'>kém vui</strong>. Cô <strong class='idiom-tip' idx='15'>cho phép</strong> con ếch ngủ trên gối của mình. Sáng hôm sau, cô hôn nó.</p><p>Đột nhiên, nó biến thành một <strong class='idiom-tip' idx='11'>người</strong>. Nó nói, &ldquo;Tôi đến từ một vương quốc <strong class='idiom-tip' idx='0'>ở nước ngoài</strong>. Khi còn trẻ, tôi đã <strong class='idiom-tip' idx='19'>chọc giận</strong> một <strong class='idiom-tip' idx='18'>bộ tộc</strong> phù thủy độc ác, họ đã biến tôi thành con ếch.&rdquo;</p><p>Công chúa hỏi, &ldquo;Tôi có thể là <strong class='idiom-tip' idx='2'>vợ</strong> của anh và ở bên anh <strong class='idiom-tip' idx='10'>mãi mãi</strong>?&rdquo; Nhưng hoàng tử nói, &ldquo;Không. Cô đã <strong class='idiom-tip' idx='5'>làm tôi thất vọng</strong>. Cô đã không giữ lời hứa.&rdquo;</p>",
            "image": "25193.jpg",
            "sound": "25193.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. A guy who angers a cruel witch</li><li>b. How people are not always what they seem to be</li><li>c. Why princes should go abroad to find a bride</li><li>d. How to keep promises made in exchange for favors</li></ul></li><li class='answer-the-questions-section' answer-index='1'>The frog asked the lovely princess to __________.<ul class='ul-choose-answer'><li>a. be in a better mood</li><li>b. kiss him in the morning</li><li>c. dive into the pool to get the ball</li><li>d. permit him to live in the palace</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What can be assumed from the passage?<ul class='ul-choose-answer'><li>a. The princess was humiliated when the prince didn&rsquo;t take her back to his kingdom.</li><li>b. The prince and princess were only happy for a brief time.</li><li>c. The frog protested he didn&rsquo;t need gold because he was rich.</li><li>d. The prince was turned into a frog during his youth.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all of the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the king made the princess keep her promise</li><li>b. the princess asked the prince if she could be his bride and stay with him forever</li><li>c. the princess chased her sculpture until it fell into the pool</li><li>d. the frog disappointed the princess by turning into a prince</li></ul></li><li class='answer-the-questions-textarea' value='She thought the frog would die if he leaves the pool.'>Why did the princess think she would not have to keep her promise? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>She thought the frog would die if he leaves the pool. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "A Beautiful Bird",
            "story": "<p>Dr. Norton&rsquo;s <strong class='idiom-tip' idx='12'>occupation </strong>was a <strong class='idiom-tip' idx='17'>scholar </strong>of <strong class='idiom-tip' idx='1'>biology</strong>. He learned about all animals on a daily <strong class='idiom-tip' idx='0'>basis</strong>. One day he met a sailor from a <strong class='idiom-tip' idx='4'>colony</strong> <strong class='idiom-tip' idx='13'>overseas</strong>. The man told Dr. Norton about a talking bird! The bird <strong class='idiom-tip' idx='9'>fascinated </strong>Dr. Norton, so he told his <strong class='idiom-tip' idx='3'>colleagues </strong>about it. They <strong class='idiom-tip' idx='5'>debated </strong>with him: no one thought a bird could talk. He tried to <strong class='idiom-tip' idx='14'>persuade </strong>them, but they laughed at him. <strong class='idiom-tip' idx='11'>Nevertheless</strong>, Dr. Norton believed the bird was real. His new <strong class='idiom-tip' idx='10'>mission </strong>was to find it. He wanted <strong class='idiom-tip' idx='8'>factual </strong>proof.</p><p>The next day he <strong class='idiom-tip' idx='6'>departed </strong>for the colony. The sailor he had met told him to look for a man named Jai, who would be able to help him in his search. After a month of sailing, Dr. Norton finally reached the colony where he met Jai.</p><p>&ldquo;I can take you to where it lives. It lives by the <strong class='idiom-tip' idx='19'>volcano</strong>,&rdquo; Jai said. They left the next day. A week later, they arrived at the volcano. Every day they walked around and looked for the bird, but they couldn&rsquo;t find it. After one month, Dr. Norton could not find the bird, and this <strong class='idiom-tip' idx='7'>depressed </strong>him. He decided to go home. On the <strong class='idiom-tip' idx='15'>route </strong>back, he walked past some old <strong class='idiom-tip' idx='16'>ruins</strong>. He heard someone say, &ldquo;Hello.&rdquo;</p><p>&ldquo;Who are you?&rdquo; he asked. Dr. Norton looked up and saw a bird!</p><p>Dr. Norton put the talking bird into a <strong class='idiom-tip' idx='2'>cage</strong>. Then he returned home. He had made a <strong class='idiom-tip' idx='18'>significant </strong>discovery.</p>",
            "vi": "<p>Tiến sĩ Norton là một <strong class='idiom-tip' idx='12'>nhà nghiên cứu</strong> về <strong class='idiom-tip' idx='1'>sinh học</strong>. Ông học về tất cả các loài động vật hàng ngày. Một ngày, ông gặp một thủy thủ từ một <strong class='idiom-tip' idx='4'>thuộc địa</strong> <strong class='idiom-tip' idx='13'>ở nước ngoài</strong>. Người đàn ông kể cho Tiến sĩ Norton về một con chim biết nói! Con chim <strong class='idiom-tip' idx='9'>làm say mê</strong> Tiến sĩ Norton, vì vậy ông kể cho các <strong class='idiom-tip' idx='3'>đồng nghiệp</strong> của mình. Họ <strong class='idiom-tip' idx='5'>tranh luận</strong> với ông: không ai nghĩ rằng một con chim có thể nói. Ông cố gắng <strong class='idiom-tip' idx='14'>thuyết phục</strong> họ, nhưng họ cười nhạo ông. <strong class='idiom-tip' idx='11'>Tuy nhiên</strong>, Tiến sĩ Norton tin rằng con chim là thật. Nhiệm vụ mới của ông là tìm nó. Ông muốn có <strong class='idiom-tip' idx='8'>bằng chứng thực tế</strong>.</p><p>Ngày hôm sau, ông <strong class='idiom-tip' idx='6'>khởi hành</strong> đến thuộc địa. Thủy thủ mà ông đã gặp bảo ông tìm một người tên là Jai, người có thể giúp ông trong việc tìm kiếm. Sau một tháng lênh đênh trên biển, Tiến sĩ Norton cuối cùng đã đến thuộc địa và gặp Jai.</p><p>&ldquo;Tôi có thể đưa bạn đến nơi con chim sống. Nó sống gần một <strong class='idiom-tip' idx='19'>núi lửa</strong>,&rdquo; Jai nói. Họ rời đi vào ngày hôm sau. Một tuần sau, họ đến núi lửa. Mỗi ngày họ đi vòng quanh và tìm con chim, nhưng họ không thể tìm thấy nó. Sau một tháng, Tiến sĩ Norton không thể tìm được con chim, và điều này làm ông <strong class='idiom-tip' idx='7'>chán nản</strong>. Ông quyết định trở về. Trên <strong class='idiom-tip' idx='15'>đường</strong> trở về, ông đi qua một số <strong class='idiom-tip' idx='16'>phế tích</strong>. Ông nghe ai đó nói, &ldquo;Xin chào.&rdquo;</p><p>&ldquo;Bạn là ai?&rdquo; ông hỏi. Tiến sĩ Norton nhìn lên và thấy một con chim!</p><p>Tiến sĩ Norton bỏ con chim biết nói vào một <strong class='idiom-tip' idx='2'>lồng</strong>. Sau đó ông trở về nhà. Ông đã có một <strong class='idiom-tip' idx='18'>phát hiện quan trọng</strong>.</p>",
            "image": "25220.jpg",
            "sound": "25220.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. A route to a new place </li><li>b. A scholar who finds a talking bird </li><li>c. How to learn about biology</li><li>d. Why people debate each other</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did Dr. Norton go overseas? <ul class='ul-choose-answer'><li>a. He wanted to depart from his colleagues and start a new life. </li><li>b. He was on a mission to find the talking bird. </li><li>c. He wanted to see the volcano. </li><li>d. He wanted to discover some old ruins.</li></ul></li><li class='answer-the-questions-section' answer-index='2'> At the end of the story, we can infer that __________.<ul class='ul-choose-answer'> <li>a. Jai didn’t like Dr. Norton but nevertheless cheered his discovery </li><li>b. finding the volcano was also a significant discovery</li><li>c. the bird would be the factual proof that would persuade his colleagues </li><li>d. the bird had fascinated people in the colony for a long time</li></ul></li><li class='answer-the-questions-section' answer-index='0'> According to the passage, all the following are true EXCEPT __________. <ul class='ul-choose-answer'><li>a. Jai fed bread to the talking bird </li><li>b. Dr. Norton put the bird into a cage</li><li>c. Dr. Norton took a ship to the colony </li><li>d. the talking bird was in the ruins</li></ul></li><li class='answer-the-questions-textarea' value='He could not find the talking bird after looking for one month.'> What depressed Dr. Norton? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>He could not find the talking bird after looking for one month.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Tricky Turtle",
            "story": "<p>Ricky the rabbit and Tera the turtle met by the <strong class='idiom-tip' idx='13'>edge </strong>of the river. &ldquo;No one is <strong class='idiom-tip' idx='2'>capable </strong>of beating me in a race!&rdquo; Ricky said. He was <strong class='idiom-tip' idx='6'>confident</strong>&mdash;his smile <strong class='idiom-tip' idx='8'>conveyed </strong>that.</p><p>&ldquo;I can beat you,&rdquo; Tera said.</p><p>Ricky laughed with <strong class='idiom-tip' idx='10'>delight</strong>.</p><p>Tera said, &ldquo;We will race tomorrow. The <strong class='idiom-tip' idx='11'>destination </strong>is the hill.&rdquo;</p><p>Ricky agreed. Tera <strong class='idiom-tip' idx='4'>concentrated </strong>on winning the race. She was not faster than Ricky. She needed a <strong class='idiom-tip' idx='9'>definite </strong>way to <strong class='idiom-tip' idx='17'>succeed</strong>. She told her family about the race, &ldquo;I have <strong class='idiom-tip' idx='5'>concluded </strong>that I have to <strong class='idiom-tip' idx='15'>resort </strong>to something bad. I will <strong class='idiom-tip' idx='3'>cheat</strong>.&rdquo; She <strong class='idiom-tip' idx='12'>dictated </strong>her instructions to them.</p><p>At the race, they all wore white feathers. They looked exactly the same! Then, her family members hid in <strong class='idiom-tip' idx='16'>shadows </strong>on the <strong class='idiom-tip' idx='14'>path</strong>.</p><p>The race began. Tera was soon far behind. However, Tera&rsquo;s brother hid behind a <strong class='idiom-tip' idx='1'>bush </strong>in the <strong class='idiom-tip' idx='9'>valley </strong>below. When Ricky got close, Tera&rsquo;s brother began to run. He looked just like Tera! Ricky ran as fast as he could along the path. But, to him, it seemed like Tera was always ahead. Ricky had used a <strong class='idiom-tip' idx='7'>considerable </strong>amount of energy.</p><p>He reached the top, but Tera&rsquo;s sister was already there. &ldquo;Well, you win,&rdquo; Ricky said.</p><p>Later, Tera had a <strong class='idiom-tip' idx='0'>broad </strong>smile on her face. Ricky never <strong class='idiom-tip' idx='18'>suspected</strong>. He had been tricked by a family of slow turtles.</p>",
            "vi": "<p>Ricky con thỏ và Tera con rùa gặp nhau bên <strong class='idiom-tip' idx='13'>bờ</strong> của con sông. &ldquo;Không ai <strong class='idiom-tip' idx='2'>có khả năng</strong> đánh bại tôi trong một cuộc đua!&rdquo; Ricky nói. Anh ta <strong class='idiom-tip' idx='6'>tự tin</strong>—nụ cười của anh <strong class='idiom-tip' idx='8'>truyền tải</strong> điều đó.</p><p>&ldquo;Tôi có thể đánh bại bạn,&rdquo; Tera nói.</p><p>Ricky cười với <strong class='idiom-tip' idx='10'>niềm vui</strong>.</p><p>Tera nói, &ldquo;Chúng ta sẽ đua vào ngày mai. <strong class='idiom-tip' idx='11'>Điểm đến</strong> là đồi.&rdquo;</p><p>Ricky đồng ý. Tera <strong class='idiom-tip' idx='4'>tập trung</strong> vào việc thắng cuộc đua. Cô không nhanh bằng Ricky. Cô cần một <strong class='idiom-tip' idx='9'>cách chắc chắn</strong> để <strong class='idiom-tip' idx='17'>thành công</strong>. Cô kể cho gia đình về cuộc đua, &ldquo;Tôi đã <strong class='idiom-tip' idx='5'>kết luận</strong> rằng tôi phải <strong class='idiom-tip' idx='15'>kế hoạch</strong> một cái gì đó xấu. Tôi sẽ <strong class='idiom-tip' idx='3'>gian lận</strong>.&rdquo; Cô <strong class='idiom-tip' idx='12'>ra lệnh</strong> cho họ.</p><p>Trong cuộc đua, tất cả bọn họ đều mặc lông trắng. Họ trông hoàn toàn giống nhau! Sau đó, các thành viên trong gia đình cô trốn trong các <strong class='idiom-tip' idx='16'>bóng râm</strong> trên con <strong class='idiom-tip' idx='14'>đường</strong>.</p><p>Cuộc đua bắt đầu. Tera ngay lập tức bị bỏ lại xa phía sau. Tuy nhiên, em trai của Tera trốn sau một <strong class='idiom-tip' idx='1'>bụi cây</strong> trong <strong class='idiom-tip' idx='9'>thung lũng</strong> phía dưới. Khi Ricky lại gần, em trai của Tera bắt đầu chạy. Anh ta trông giống hệt Tera! Ricky chạy càng nhanh càng tốt trên con đường. Nhưng, với Ricky, có vẻ như Tera luôn ở phía trước. Ricky đã tiêu tốn một <strong class='idiom-tip' idx='7'>lượng lớn</strong> năng lượng.</p><p>Anh ta đến đỉnh, nhưng chị của Tera đã ở đó rồi. &ldquo;Thôi, bạn thắng,&rdquo; Ricky nói.</p><p>Sau đó, Tera có một nụ cười <strong class='idiom-tip' idx='0'>rộng lớn</strong> trên mặt. Ricky không bao giờ <strong class='idiom-tip' idx='18'>nghi ngờ</strong>. Anh đã bị lừa bởi một gia đình rùa chậm chạp.</p>",
            "image": "25246.jpg",
            "sound": "25246.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='0'>What is this story about?<ul class='ul-choose-answer'><li>a. A confident rabbit</li><li>b. A rabbit that cheats in a race</li><li>c. A turtle that rests in shadows</li><li>d. A turtle with a crazy idea and a broad family</li></ul></li><li class='answer-the-questions-section' answer-index='3'>Where was the final destination of the race?<ul class='ul-choose-answer'><li>a. The edge of the river</li><li>b. Behind the first bush</li><li>c. The middle of the valley</li><li>d. The top of the hill</li></ul></li><li class='answer-the-questions-section' answer-index='0'>Why was Tera the Turtle angry?<ul class='ul-choose-answer'><li>a. Because Ricky the rabbit said no one was capable of beating him</li><li>b. Because she thought that the path of the race was too difficult</li><li>c. Because she knew Rabbit would resort to cheating</li><li>d. Because her family wouldn&rsquo;t gather when she asked them to</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What did Tera say to her family?<ul class='ul-choose-answer'><li>a. She concluded that she must concentrate on the race.</li><li>b. She conveyed that Rabbit would cheat.</li><li>c. She told them about her definite plan to succeed.</li><li>d. She said the race would take a considerable amount of energy.</li></ul></li><li class='answer-the-questions-textarea' value='He had been tricked by a family of slow turtles.'>What had Rabbit never suspected? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>He had been tricked by a family of slow turtles.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Tale of Bartelby O’Boyle",
            "story": "<p>Long ago, there was a clever man by the name of Bartelby O&rsquo;Boyle. As a boy, he was kept as a <strong class='idiom-tip' idx='17'>slave </strong>by the <strong class='idiom-tip' idx='16'>royal </strong>family. He saw other children play, but he always had to work. This <strong class='idiom-tip' idx='11'>frustrated </strong>him very much. But he was not <strong class='idiom-tip' idx='19'>stupid</strong>, and he wanted to change things.</p><p>Then one day there was a <strong class='idiom-tip' idx='18'>struggle </strong>for <strong class='idiom-tip' idx='3'>authority </strong>in the kingdom. There was a <strong class='idiom-tip' idx='9'>division </strong>of the people, and one group fought against another group to see which would <strong class='idiom-tip' idx='12'>govern </strong>the kingdom. There was <strong class='idiom-tip' idx='8'>disorder </strong>in the kingdom. Bartelby ran away. He saw much fighting and <strong class='idiom-tip' idx='7'>destruction</strong>. Many people had nothing to eat; Bartelby decided to <strong class='idiom-tip' idx='1'>aid </strong>them. He would help them get food. But how?</p><p>Bartelby went to the <strong class='idiom-tip' idx='4'>capital </strong>to find an answer. There, he met a man named Gilliam. A group of men <strong class='idiom-tip' idx='2'>attempted </strong>to hurt Gilliam. Bartelby <strong class='idiom-tip' idx='6'>defended</strong> him. Then, he gave Gilliam some food to <strong class='idiom-tip' idx='14'>relieve </strong>his hunger. After that, the two became friends. They took food from the rich and gave it to the poor.</p><p>Soon, other people <strong class='idiom-tip' idx='5'>cooperated </strong>with them. Working together <strong class='idiom-tip' idx='10'>anabled </strong>them to take more food, butt they only took food from people who had <strong class='idiom-tip' idx='13'>plenty</strong>, and they always gave it to those who had none. Because of this, Bartleby gained a <strong class='idiom-tip' idx='15'>reputation </strong>across the kingdom. Even today, many people <strong class='idiom-tip' idx='0'>admire </strong>him for helping the poor.</p>",
            "vi": "<p>Ngày xưa, có một người thông minh tên là Bartelby O&rsquo;Boyle. Khi còn nhỏ, ông bị giữ làm <strong class='idiom-tip' idx='17'>nô lệ</strong> cho <strong class='idiom-tip' idx='16'>hoàng gia</strong>. Ông nhìn các đứa trẻ khác chơi, nhưng ông luôn phải làm việc. Điều này làm ông rất <strong class='idiom-tip' idx='11'>bực bội</strong>. Nhưng ông không <strong class='idiom-tip' idx='19'>ngu ngốc</strong>, và ông muốn thay đổi điều đó.</p><p>Rồi một ngày, có một cuộc <strong class='idiom-tip' idx='18'>đấu tranh</strong> về <strong class='idiom-tip' idx='3'>quyền lực</strong> trong vương quốc. Có một <strong class='idiom-tip' idx='9'>sự phân chia</strong> trong dân chúng, và một nhóm đã chiến đấu với nhóm khác để xem nhóm nào sẽ <strong class='idiom-tip' idx='12'>quản lý</strong> vương quốc. Có sự <strong class='idiom-tip' idx='8'>hỗn loạn</strong> trong vương quốc. Bartelby đã bỏ trốn. Ông thấy nhiều cuộc chiến đấu và <strong class='idiom-tip' idx='7'>hủy diệt</strong>. Nhiều người không có gì để ăn; Bartelby quyết định <strong class='idiom-tip' idx='1'>giúp đỡ</strong> họ. Ông sẽ giúp họ có thức ăn. Nhưng làm thế nào?</p><p>Bartelby đến <strong class='idiom-tip' idx='4'>thủ đô</strong> để tìm câu trả lời. Tại đó, ông gặp một người tên là Gilliam. Một nhóm người <strong class='idiom-tip' idx='2'>cố gắng</strong> làm hại Gilliam. Bartelby <strong class='idiom-tip' idx='6'>bảo vệ</strong> ông. Sau đó, ông cho Gilliam một ít thức ăn để <strong class='idiom-tip' idx='14'>giảm bớt</strong> cơn đói của ông. Sau đó, hai người trở thành bạn bè. Họ lấy thức ăn từ người giàu và đưa cho người nghèo.</p><p>Rất nhanh chóng, những người khác <strong class='idiom-tip' idx='5'>hợp tác</strong> với họ. Làm việc cùng nhau <strong class='idiom-tip' idx='10'>cho phép</strong> họ lấy được nhiều thức ăn hơn, nhưng họ chỉ lấy thức ăn từ những người có <strong class='idiom-tip' idx='13'>nhiều</strong>, và luôn đưa nó cho những người không có. Chính vì vậy, Bartelby đã có một <strong class='idiom-tip' idx='15'>danh tiếng</strong> trên toàn vương quốc. Ngay cả ngày nay, nhiều người <strong class='idiom-tip' idx='0'>ngưỡng mộ</strong> ông vì đã giúp đỡ người nghèo.</p>",
            "image": "25273.jpg",
            "sound": "25273.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. How a slave became a king</li><li>b. How a stupid mistake made Bartelby a slave</li><li>c. How a lad found plenty of food</li><li>d. How a man aided poor people</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What did Bartelby do in the capital?<ul class='ul-choose-answer'><li>a. He cooperated with his group of friends.</li><li>b. He enabled Gilliam to have authority over the king.</li><li>c. He relieved Gilliam of his hunger.</li><li>d. He found a mask to wear.</li></ul></li><li class='answer-the-questions-section' answer-index='0'>In paragraph 1, we can infer that __________.<ul class='ul-choose-answer'><li>a. Bartelby did not like the royal family</li><li>b. the family attempted to cause disorder</li><li>c. the other children were not clever</li><li>d. Bartelby had a bad reputation</li></ul></li><li class='answer-the-questions-section' answer-index='1'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. people today still admire Bartleby</li><li>b. Gilliam struggled with Bartley</li><li>c. Bartleby defended Gilliam</li><li>d. the fighting caused destruction</li></ul></li><li class='answer-the-questions-textarea' value='He had to work and could not play.'>What frustrated Bartelby when he was a child? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>He had to work and could not play.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Blackbeard",
            "story": "<p>A longtime ago, I had my first job. It didn&rsquo;t give me much of an <strong class='idiom-tip' idx='9'>income</strong>. It was on a <strong class='idiom-tip' idx='7'>giant </strong>pirate ship. On my first night, there was a thick <strong class='idiom-tip' idx='5'>fog </strong>over the water. A lamp on the ship <strong class='idiom-tip' idx='13'>revealed </strong>an <strong class='idiom-tip' idx='3'>enormous </strong>man. He had a <strong class='idiom-tip' idx='15'>sword </strong>in his belt. His name was Blackbeard, and he was one of the most <strong class='idiom-tip' idx='19'>violent </strong>pirates ever.</p><p>One day, Blackbeard did an <strong class='idiom-tip' idx='4'>extraordinary </strong>thing. He attacked several ships near a town. He took some of the town&rsquo;s <strong class='idiom-tip' idx='0'>citizens</strong>. Then he <strong class='idiom-tip' idx='2'>declared</strong>, &ldquo;You give me medicine!&rdquo; Blackbeard wanted the medicine for some of the sick pirates on his ship.</p><p>The people had a bad <strong class='idiom-tip' idx='8'>impression </strong>of him. They were <strong class='idiom-tip' idx='10'>mad</strong>, and they <strong class='idiom-tip' idx='12'>resisted</strong>. But they were <strong class='idiom-tip' idx='17'>trapped</strong>. They wanted to get rid of him. So the town&rsquo;s <strong class='idiom-tip' idx='1'>council </strong>decided to give him the medicine.</p><p>After this, there was a reward for catching Blackbeard. If Blackbeard was caught, he would have a <strong class='idiom-tip' idx='18'>trial</strong>. He didn&rsquo;t want to go to jail, so he quit being a pirate.</p><p>Blackbeard became a fisherman. But he <strong class='idiom-tip' idx='11'>ought </strong>to have stayed on land. The Royal Navy was still looking for him. They attacked him while he was fishing on his boat. Blackbeard fought against many men. Finally, he was killed. He didn&rsquo;t even get a <strong class='idiom-tip' idx='6'>funeral</strong>. But people still tell <strong class='idiom-tip' idx='16'>tales </strong>about him many years later.</p>",
            "vi": "<p>Ngày xưa, tôi có công việc đầu tiên của mình. Nó không mang lại cho tôi nhiều <strong class='idiom-tip' idx='9'>thu nhập</strong>. Đó là trên một chiếc tàu cướp biển <strong class='idiom-tip' idx='7'>khổng lồ</strong>. Vào đêm đầu tiên của tôi, có một lớp <strong class='idiom-tip' idx='5'>sương mù</strong> dày đặc trên mặt nước. Một chiếc đèn trên tàu <strong class='idiom-tip' idx='13'>tiết lộ</strong> một người đàn ông <strong class='idiom-tip' idx='3'>khổng lồ</strong>. Ông ta có một <strong class='idiom-tip' idx='15'>con dao</strong> trong thắt lưng của mình. Tên của ông ta là Blackbeard, và ông là một trong những tên cướp biển <strong class='idiom-tip' idx='19'>bạo lực</strong> nhất từ trước đến nay.</p><p>Một ngày, Blackbeard đã làm một việc <strong class='idiom-tip' idx='4'>ngoại lệ</strong>. Ông tấn công nhiều con tàu gần một thị trấn. Ông bắt một số <strong class='idiom-tip' idx='0'>dân cư</strong> của thị trấn. Sau đó, ông <strong class='idiom-tip' idx='2'>tuyên bố</strong>, &ldquo;Các người hãy cho tôi thuốc men!&rdquo; Blackbeard muốn thuốc cho một số tên cướp biển bị bệnh trên tàu của mình.</p><p>Người dân có một <strong class='idiom-tip' idx='8'>ấn tượng</strong> xấu về ông. Họ <strong class='idiom-tip' idx='10'>giận dữ</strong>, và họ <strong class='idiom-tip' idx='12'>kháng cự</strong>. Nhưng họ đã bị <strong class='idiom-tip' idx='17'>vây hãm</strong>. Họ muốn thoát khỏi ông. Vì vậy, hội đồng thị trấn quyết định đưa cho ông thuốc.</p><p>Sau đó, có một phần thưởng cho việc bắt giữ Blackbeard. Nếu Blackbeard bị bắt, ông sẽ phải ra <strong class='idiom-tip' idx='18'>tòa</strong>. Ông không muốn đi tù, vì vậy ông đã bỏ nghề cướp biển.</p><p>Blackbeard trở thành một ngư dân. Nhưng ông <strong class='idiom-tip' idx='11'>nên</strong> đã ở lại trên đất liền. Hải quân Hoàng gia vẫn đang tìm kiếm ông. Họ tấn công ông khi ông đang câu cá trên thuyền. Blackbeard đã chiến đấu chống lại nhiều người. Cuối cùng, ông bị giết. Ông không hề có một <strong class='idiom-tip' idx='6'>lễ tang</strong>. Nhưng mọi người vẫn kể <strong class='idiom-tip' idx='16'>huyền thoại</strong> về ông nhiều năm sau đó.</p>",
            "image": "25299.jpg",
            "sound": "25299.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this tale about? <ul class='ul-choose-answer'><li>a. How many pirates become fishermen </li><li>b. An enormous violent pirate </li><li>c. A boy resisting having to take medicine </li><li>d. A ship that ought to have stayed at sea</li></ul></li><li class='answer-the-questions-section' answer-index='1'>What can be assumed from the passage? <ul class='ul-choose-answer'><li>a. The town gave Blackbeard the medicine. </li><li>b. Blackbeard was an extraordinary fighter. </li><li>c. Blackbeard’s lamp revealed where he was. </li><li>d. The citizens were mad when Blackbeard was killed.</li></ul></li><li class='answer-the-questions-section' answer-index='0'>Which of the following is true about Blackbeard? <ul class='ul-choose-answer'><li>a. He kept his sword in his belt. </li><li>b. He lit his cigarettes using a lamp. </li><li>c. He wanted to get rid of his giant ship. </li><li>d. He had a trial in the town.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>Why were the people in town trapped? <ul class='ul-choose-answer'><li>a. Blackbeard was waiting for a reward. </li><li>b. The fog was too thick for ships to sail in. </li><li>c. Blackbeard wouldn’t let ships in or out.</li><li>d. Blackbeard declared that there was a strong storm coming.</li></ul></li><li class='answer-the-questions-textarea' value='He did not want to be put on trial and go to jail.'>Why did Blackbeard stop being a pirate? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>He did not want to be put on trial and go to jail. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Dinosaur Drawings",
            "story": "<p>It was the worst morning ever. When Carl woke up, he realized that he didn&rsquo;t do his <strong class='idiom-tip' idx='1'>astronomy </strong>and <strong class='idiom-tip' idx='3'>chemistry </strong>homework. Also, the <strong class='idiom-tip' idx='8'>forecast</strong> called for rain and that would affect baseball practice. Suddenly, his mother yelled, &ldquo;Take out the garbage right now!&rdquo; When Carl returned from taking the garbage outside, he was all <strong class='idiom-tip' idx='19'>wet</strong>. &ldquo;What a terrible day,&rdquo; he said.</p><p>He walked to class. He put his umbrella on the shelf and sat in the third <strong class='idiom-tip' idx='15'>row</strong>. But the teacher asked why Carl&rsquo;s umbrella was on the floor. He told her not to <strong class='idiom-tip' idx='2'>blame </strong>him. But she sent him to the <strong class='idiom-tip' idx='14'>principal </strong>out of <strong class='idiom-tip' idx='17'>spite</strong>.</p><p>Next, he took a <strong class='idiom-tip' idx='11'>geography </strong>test. <strong class='idiom-tip' idx='4'>Despite </strong>studying, Carl didn&rsquo;t know the answers. He started drawing <strong class='idiom-tip' idx='13'>lightly </strong>on his paper.</p><p>Carl drew a huge <strong class='idiom-tip' idx='5'>dinosaur</strong>. What if it were real? He saw it in his mind. Carl&rsquo;s class said he was a <strong class='idiom-tip' idx='9'>genius </strong>for having a dinosaur. It could <strong class='idiom-tip' idx='12'>interfere</strong> with math class, too! Soon, Carl&rsquo;s <strong class='idiom-tip' idx='7'>fame </strong>spread through school.</p><p>He taught his dinosaur to be very <strong class='idiom-tip' idx='10'>gentle </strong>and put it on <strong class='idiom-tip' idx='6'>exhibit</strong>. But <strong class='idiom-tip' idx='0'>admission </strong>would only be given to those classmates who paid him a fee. His idea was <strong class='idiom-tip' idx='18'>super</strong>.</p><p>&ldquo;It&rsquo;s time to turn in your tests,&rdquo; the teacher said. Carl looked at his paper. As he was dreaming in class, he hadn&rsquo;t finished the test!</p>",
            "vi": "<p>Sáng hôm đó là một buổi sáng tồi tệ nhất. Khi Carl thức dậy, anh nhận ra rằng mình chưa làm bài tập về <strong class='idiom-tip' idx='1'>thiên văn học</strong> và <strong class='idiom-tip' idx='3'>hóa học</strong>. Hơn nữa, dự <strong class='idiom-tip' idx='8'>báo</strong> thời tiết nói rằng trời sẽ mưa và điều đó sẽ ảnh hưởng đến buổi tập bóng chày. Đột nhiên, mẹ anh la lên, “Đem rác ra ngoài ngay!” Khi Carl trở về từ việc đổ rác, anh ướt sũng. “Một ngày thật tồi tệ,” anh nói.</p><p>Anh đi đến lớp. Anh để ô lên kệ và ngồi ở <strong class='idiom-tip' idx='15'>hàng thứ ba</strong>. Nhưng giáo viên hỏi tại sao ô của Carl lại ở trên sàn. Anh bảo cô đừng <strong class='idiom-tip' idx='2'>đổ lỗi</strong> cho anh. Nhưng cô đã gửi anh đến <strong class='idiom-tip' idx='14'>hiệu trưởng</strong> vì <strong class='idiom-tip' idx='17'>mối hận</strong>.</p><p>Kế tiếp, anh làm bài kiểm tra <strong class='idiom-tip' idx='11'>địa lý</strong>. <strong class='idiom-tip' idx='4'>Mặc dù</strong> đã học, Carl không biết các câu trả lời. Anh bắt đầu vẽ <strong class='idiom-tip' idx='13'>nhẹ nhàng</strong> trên giấy của mình.</p><p>Carl vẽ một con <strong class='idiom-tip' idx='5'>khủng long</strong> khổng lồ. Nếu nó là thật thì sao? Anh nhìn thấy nó trong tâm trí mình. Lớp học của Carl nói rằng anh là một <strong class='idiom-tip' idx='9'>thiên tài</strong> vì có một con khủng long. Nó cũng có thể <strong class='idiom-tip' idx='12'>can thiệp</strong> vào lớp toán nữa! Chẳng bao lâu, <strong class='idiom-tip' idx='7'>danh tiếng</strong> của Carl lan truyền khắp trường.</p><p>Anh dạy khủng long của mình trở nên rất <strong class='idiom-tip' idx='10'>hiền lành</strong> và trưng bày nó. Nhưng <strong class='idiom-tip' idx='0'>nhập học</strong> chỉ dành cho những bạn học trả tiền cho anh. Ý tưởng của anh là <strong class='idiom-tip' idx='18'>tuyệt vời</strong>.</p><p>“Đã đến lúc nộp bài kiểm tra của các em,” giáo viên nói. Carl nhìn vào giấy của mình. Khi đang mơ mộng trong lớp, anh đã không hoàn thành bài kiểm tra!</p>",
            "image": "25326.jpg",
            "sound": "25326.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. A wet classroom </li><li>b. A boy who is a genius </li><li>c. A bell that keeps ringing </li><li>d. A day that was not super</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What does Carl think his dinosaur can do? <ul class='ul-choose-answer'><li>a. Make money for him on admission fees </li><li>b. Interfere with taking out the garbage </li><li>c. Take the blame for failing geography </li><li>d. Reach things on the top shelf</li></ul></li><li class='answer-the-questions-section' answer-index='1'> What did Carl do? <ul class='ul-choose-answer'><li>a. Break a jar at breakfast </li><li>b. Draw lightly on his test paper </li><li>c. Forget his hat on the bus </li><li>d. Stay after school for being late</li></ul></li><li class='answer-the-questions-section' answer-index='3'>Despite Carl studying for his test, what happened? <ul class='ul-choose-answer'><li>a. His teacher was not gentle with him. </li><li>b. He had to sit in the last row. </li><li>c. The exhibit did not earn him any fame. </li><li>d. He did not do well on his geography test.</li></ul></li><li class='answer-the-questions-textarea' value='No. It was going to rain very hard that day.'> Do you think that Carl will have baseball practice after school? Why? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>No. It was going to rain very hard that day.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Mean Chef",
            "story": "<p>Once there was a chef, who was mean to his cooks. He was mean to the people who came in to eat. He charged too much for meals. Many people were not able to <strong class='idiom-tip' idx='1'>afford </strong>the cheapest <strong class='idiom-tip' idx='3'>bean </strong>dish. When his <strong class='idiom-tip' idx='14'>metal </strong>oven broke, he did not have it fixed. So everything <strong class='idiom-tip' idx='2'>baked </strong>in it burned. The only light was from <strong class='idiom-tip' idx='4'>candles</strong>, and the whole place was a <strong class='idiom-tip' idx='13'>mess</strong>. Sometimes, he didn&rsquo;t pay his waiters. Since they had no <strong class='idiom-tip' idx='9'>funds</strong>, they had many <strong class='idiom-tip' idx='6'>debts</strong>.</p><p>The chef behaved this way all the time. He <strong class='idiom-tip' idx='15'>monitored </strong>the cooks and yelled if they did not do things his way.</p><p>One day, the cooks decided that they were tired of the <strong class='idiom-tip' idx='0'>abuse </strong>and that they would not be <strong class='idiom-tip' idx='17'>passive </strong>anymore. Everyone <strong class='idiom-tip' idx='16'>opposed </strong>the chef. At first, they thought about <strong class='idiom-tip' idx='19'>suing </strong>him. Instead, they tied up the chef with rope. Now, they controlled the restaurant! They <strong class='idiom-tip' idx='7'>decreased </strong>the price of food. They used the best <strong class='idiom-tip' idx='11'>ingredients </strong>and made large <strong class='idiom-tip' idx='18'>quantities </strong>of food. They turned on the lights. The restaurant was <strong class='idiom-tip' idx='5'>converted </strong>into a happy place. For the first time, many people came to eat.</p><p>The chef realized that the restaurant&rsquo;s problems were his <strong class='idiom-tip' idx='8'>fault</strong>. The chef learned an important lesson. The new, <strong class='idiom-tip' idx='10'>generous </strong>chef <strong class='idiom-tip' idx='12'>insisted </strong>on giving the customers a free meal.</p>",
            "vi": "<p>Ngày xưa có một đầu bếp, người rất ác cảm với các đầu bếp của mình. Ông cũng đối xử tệ với những người đến ăn. Ông tính tiền món ăn quá cao. Nhiều người không đủ <strong class='idiom-tip' idx='1'>khả năng chi trả</strong> cho món <strong class='idiom-tip' idx='3'>đậu</strong> rẻ nhất. Khi lò <strong class='idiom-tip' idx='14'>kim loại</strong> của ông bị hỏng, ông không sửa chữa nó. Vì vậy, mọi thứ <strong class='idiom-tip' idx='2'>nướng</strong> trong đó đều bị cháy. Ánh sáng duy nhất là từ <strong class='idiom-tip' idx='4'>nến</strong>, và toàn bộ nơi đó rất <strong class='idiom-tip' idx='13'>lộn xộn</strong>. Đôi khi, ông không trả tiền cho những người phục vụ. Vì họ không có <strong class='idiom-tip' idx='9'>quỹ</strong>, họ mắc nhiều <strong class='idiom-tip' idx='6'>nợ</strong>.</p><p>Đầu bếp hành xử như vậy mọi lúc. Ông <strong class='idiom-tip' idx='15'>theo dõi</strong> các đầu bếp và la hét nếu họ không làm theo cách của ông.</p><p>Một ngày, các đầu bếp quyết định rằng họ đã mệt mỏi với <strong class='idiom-tip' idx='0'>sự lạm dụng</strong> và họ sẽ không còn <strong class='idiom-tip' idx='17'>bị động</strong> nữa. Mọi người <strong class='idiom-tip' idx='16'>phản đối</strong> đầu bếp. Lúc đầu, họ nghĩ đến việc <strong class='idiom-tip' idx='19'>kiện</strong> ông. Thay vào đó, họ đã trói đầu bếp bằng dây thừng. Bây giờ, họ kiểm soát nhà hàng! Họ <strong class='idiom-tip' idx='7'>giảm</strong> giá món ăn. Họ sử dụng những <strong class='idiom-tip' idx='11'>nguyên liệu</strong> tốt nhất và làm ra số lượng <strong class='idiom-tip' idx='18'>lớn</strong> món ăn. Họ bật đèn lên. Nhà hàng đã <strong class='idiom-tip' idx='5'>biến đổi</strong> thành một nơi vui vẻ. Lần đầu tiên, nhiều người đến ăn.</p><p>Đầu bếp nhận ra rằng những vấn đề của nhà hàng là do lỗi của ông. Đầu bếp đã học được một bài học quan trọng. Đầu bếp mới, <strong class='idiom-tip' idx='10'>hào phóng</strong> đã <strong class='idiom-tip' idx='12'>khẳng định</strong> sẽ cho khách hàng ăn miễn phí.</p>",
            "image": "25352.jpg",
            "sound": "25352.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='0'>What is this story about?<ul class='ul-choose-answer'><li>a. How a mean chef was converted into a generous man</li><li>b. Why metal ovens bake food until it bums</li><li>c. Why waiters&rsquo; funds are not enough to pay their debts</li><li>d. How simple beans brought a large quantity of customers</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why could people not afford to eat at the restaurant?<ul class='ul-choose-answer'><li>a. The chef insisted they take free food.</li><li>b. The chef made prices too high.</li><li>c. The chef monitored the cooks.</li><li>d. The chef got tied up.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>What did the chef learn at the end of the story?<ul class='ul-choose-answer'><li>a. Electricity was better than using candles.</li><li>b. It was his fault that the restaurant did so well.</li><li>c. The waiters and cooks took over his restaurant.</li><li>d. Behaving in a nice way is better than being mean.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, all the following are true of the waiters and cooks EXCEPT_____________.<ul class='ul-choose-answer'><li>a. they decreased prices</li><li>b. they used good ingredients</li><li>c. they were replaced by robots</li><li>d. they opposed the abuse of the chef</li></ul></li><li class='answer-the-questions-textarea' value='He gave customers free meals to celebrate his big change.'>Why did the chef insist on giving his customers a free meal at the end of the story? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>He gave customers free meals to celebrate his big change.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Cat and the Fox",
            "story": "<p>One day, a cat <strong class='idiom-tip' idx='8'>hiked </strong>on a mountain. When he reached the <strong class='idiom-tip' idx='12'>peak</strong>, he met a fox. They began talking about how they get away from their enemies.</p><p>&ldquo;I am very smart. I have <strong class='idiom-tip' idx='2'>billions </strong>of ideas. I can <strong class='idiom-tip' idx='3'>carve </strong>a <strong class='idiom-tip' idx='18'>tiny </strong>hole in a tree, and then climb in,&rdquo; the fox said. He added, &ldquo;I have a lot of friends. If I am in trouble, I can call them to <strong class='idiom-tip' idx='11'>lend </strong>their help. I can escape an entire <strong class='idiom-tip' idx='1'>army </strong>if I have to!&rdquo;</p><p>Then, the fox asked, &ldquo;What are your <strong class='idiom-tip' idx='13'>potential </strong>plans?&rdquo; The cat said, &ldquo;I have only one plan.&rdquo; The fox said, &ldquo;I hope you have good <strong class='idiom-tip' idx='6'>fortune</strong>, then! Do you want me to be your <strong class='idiom-tip' idx='19'>tutor</strong>? I can teach you many things.&rdquo; The cat said, &ldquo;I <strong class='idiom-tip' idx='7'>guarantee </strong>that my plan works every time. We can quit talking about it.&rdquo;</p><p>Soon, they saw a group of wolves. It was an <strong class='idiom-tip' idx='5'>emergency</strong>. The cat quickly used her plan. She ran up a tree. The fox could not decide which plan to use. &ldquo;What should my <strong class='idiom-tip' idx='9'>initial </strong>move be? Should I <strong class='idiom-tip' idx='4'>consult </strong>my friends?&rdquo; The fox felt <strong class='idiom-tip' idx='10'>intense</strong> <strong class='idiom-tip' idx='0'>anxiety</strong>. All he could do was <strong class='idiom-tip' idx='17'>spin </strong>in a circle. The wolves caught the fox. The cat was full of <strong class='idiom-tip' idx='14'>pride</strong>. This is <strong class='idiom-tip' idx='15'>proof </strong>that having a good plan is better than having many bad plans.</p>",
            "vi": "<p>Một ngày, một con mèo <strong class='idiom-tip' idx='8'>leo núi</strong>. Khi nó đến đỉnh <strong class='idiom-tip' idx='12'>núi</strong>, nó gặp một con cáo. Họ bắt đầu nói về cách họ thoát khỏi kẻ thù của mình.</p><p>“Tôi rất thông minh. Tôi có <strong class='idiom-tip' idx='2'>hàng tỷ</strong> ý tưởng. Tôi có thể <strong class='idiom-tip' idx='3'>khắc</strong> một <strong class='idiom-tip' idx='18'>lỗ nhỏ</strong> trên cây, rồi trèo vào trong,” con cáo nói. Nó thêm vào, “Tôi có rất nhiều bạn bè. Nếu tôi gặp rắc rối, tôi có thể gọi họ để <strong class='idiom-tip' idx='11'>giúp đỡ</strong>. Tôi có thể thoát khỏi một <strong class='idiom-tip' idx='1'>đội quân</strong> nếu cần!”</p><p>Rồi, con cáo hỏi, “Kế hoạch <strong class='idiom-tip' idx='13'>tiềm năng</strong> của bạn là gì?” Con mèo nói, “Tôi chỉ có một kế hoạch.” Con cáo nói, “Hy vọng bạn có <strong class='idiom-tip' idx='6'>may mắn</strong> nhé! Bạn có muốn tôi làm <strong class='idiom-tip' idx='19'>người dạy</strong> cho bạn không? Tôi có thể dạy bạn nhiều điều.” Con mèo nói, “Tôi <strong class='idiom-tip' idx='7'>đảm bảo</strong> kế hoạch của tôi luôn hiệu quả. Chúng ta có thể ngừng nói về nó.”</p><p>Sớm, họ thấy một nhóm sói. Đó là một <strong class='idiom-tip' idx='5'>tình huống khẩn cấp</strong>. Con mèo nhanh chóng thực hiện kế hoạch của mình. Nó chạy lên một cái cây. Con cáo không thể quyết định kế hoạch nào để sử dụng. “Nước đi <strong class='idiom-tip' idx='9'>ban đầu</strong> của tôi nên là gì? Tôi có nên <strong class='idiom-tip' idx='4'>tham khảo</strong> bạn bè của tôi không?” Con cáo cảm thấy <strong class='idiom-tip' idx='10'>căng thẳng</strong> <strong class='idiom-tip' idx='0'>lo âu</strong>. Tất cả những gì nó có thể làm là <strong class='idiom-tip' idx='17'>xoay tròn</strong>. Sói đã bắt được con cáo. Con mèo cảm thấy đầy <strong class='idiom-tip' idx='14'>hãnh diện</strong>. Đây là <strong class='idiom-tip' idx='15'>bằng chứng</strong> rằng có một kế hoạch tốt còn hơn nhiều kế hoạch xấu.</p>",
            "image": "25379.jpg",
            "sound": "25379.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. Why cats have good fortune</li><li>b. How you make guarantees about plans</li><li>c. Why you need a good plan in an emergency</li><li>d. How foxes have the potential to make billions of plans</li></ul></li><li class='answer-the-questions-section' answer-index='2'>Why did the fox feel intense anxiety?<ul class='ul-choose-answer'><li>a. Because he tried to spin in circles</li><li>b. Because his army of friends did not lend their help</li><li>c. Because he did not know what his initial move should be</li><li>d. Because he could not find a tree in which to carve a tiny hole</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why was the cat full of pride at the end of the story?<ul class='ul-choose-answer'><li>a. He hiked to the peak of the mountain.</li><li>b. He had proof that his plan was best.</li><li>c. He did not let the fox become his tutor.</li><li>d. He loved to hide in the trees.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the fox got caught by the wolves</li><li>b. the cat did not get caught by the wolves</li><li>c. the fox said he could consult his friends if he got into trouble</li><li>d. the fox decided to quit thinking of plans and just use one</li></ul></li><li class='answer-the-questions-textarea' value='His plan works every time.'>What guarantee did the cat make to the fox? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>His plan works every time.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Good Student",
            "story": "<p>Sue left her <strong class='idiom-tip' idx='6'>dormitory </strong>early that morning. She had even washed her <strong class='idiom-tip' idx='18'>uniform </strong>the night before. She wanted to look nice for the day.</p><p>Sue was <strong class='idiom-tip' idx='4'>committed </strong>to learning, and she had a <strong class='idiom-tip' idx='16'>talent </strong>for getting good grades. In fact, Sue didn&rsquo;t sleep much. She <strong class='idiom-tip' idx='5'>composed </strong>a paper and found the perfect <strong class='idiom-tip' idx='17'>thesis </strong>about the importance of <strong class='idiom-tip' idx='8'>greenhouses</strong>. She also studied for her <strong class='idiom-tip' idx='11'>physics </strong>test. Sue was already tired.</p><p>During the test, she <strong class='idiom-tip' idx='2'>calculated </strong>her answers. Soon, she felt sick. Her face got hot, and her <strong class='idiom-tip' idx='19'>vision </strong>began to blur. She was <strong class='idiom-tip' idx='1'>blind </strong>for a moment. The teacher saw Sue&rsquo;s <strong class='idiom-tip' idx='0'>apparent </strong>sickness. He wanted to send her to the nurse. But she wouldn&rsquo;t go. Sue still had a <strong class='idiom-tip' idx='12'>portion </strong>of the test to finish.</p><p>After that, Sue went to the nurse. After seeing the <strong class='idiom-tip' idx='14'>secretary</strong>, she waited. A few minutes later, the nurse came in with a glass of juice and told Sue they needed to <strong class='idiom-tip' idx='3'>chat</strong>. &ldquo;It is <strong class='idiom-tip' idx='10'>obvious </strong>that you have <strong class='idiom-tip' idx='7'>exhausted </strong>yourself,&rdquo; the nurse said. &ldquo;If you keep working so hard, it could have <strong class='idiom-tip' idx='15'>severe </strong>results.&rdquo;</p><p>&ldquo;My parents tell me that all the time. I guess I shouldn&rsquo;t <strong class='idiom-tip' idx='9'>ignore </strong>them,&rdquo; Sue said.</p><p>&ldquo;You have to <strong class='idiom-tip' idx='13'>remind </strong>yourself it is OK to rest,&rdquo; the nurse said.</p><p>When Sue got back to her room, she went right to bed. She made sure she got enough rest every night after that.</p>",
            "vi": "<p>Sue rời <strong class='idiom-tip' idx='9'>nhà</strong> để đi du lịch đến một <strong class='idiom-tip' idx='5'>ngôi làng</strong> trên núi để tìm cảm hứng cho bài hát của mình. <strong class='idiom-tip' idx='1'>Mặc dù</strong> nó lạnh, cô đã không thể giữ được sự <strong class='idiom-tip' idx='2'>hứng thú</strong>. Cô đã quyết định nghỉ lại vài ngày.</p><p>Cô khám phá ngôi làng và thấy nhiều cánh đồng xanh và những ngọn đồi đẹp. Cô thích khí hậu trong lành và không khí dễ chịu.</p><p>Sue đã sống cùng với một gia đình ở <strong class='idiom-tip' idx='15'>trung tâm</strong> ngôi làng và giúp họ làm vườn. Cô đã <strong class='idiom-tip' idx='13'>nhắm mắt</strong> và mơ về một bài hát. Cô đã <strong class='idiom-tip' idx='8'>mở cửa</strong> và lắng nghe âm thanh của thiên nhiên. Trong khi đó, âm nhạc tự <strong class='idiom-tip' idx='7'>chảy</strong> ra khỏi cô và cô <strong class='idiom-tip' idx='11'>phát triển</strong> một bài hát mới.</p><p>Sue đã hoàn thành bài hát vào ngày thứ ba và biểu diễn cho mọi người nghe. Ngôi làng tràn ngập tiếng hát và <strong class='idiom-tip' idx='4'>vui vẻ</strong>. Mọi người đã ca hát và nhảy múa quanh lửa trại.</p><p>“Tôi cảm thấy thật <strong class='idiom-tip' idx='12'>tươi mới</strong> và tràn đầy năng lượng từ chuyến đi này,” Sue nói. “Cảm hứng đến từ thiên nhiên và sự <strong class='idiom-tip' idx='6'>chăm sóc</strong>.”</p>",
            "image": "25406.jpg",
            "sound": "25406.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. A nurse reminding a student about her history paper </li><li>b. How to calculate an answer </li><li>c. A girl’s apparent talent for science </li><li>d. A girl who studies so much that she gets sick</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, why did Sue stay up late the night before? <ul class='ul-choose-answer'><li>a. She was washing her uniform. </li><li>b. She was ignoring her parents on purpose. </li><li>c. She was composing a thesis. </li><li>d. She was cleaning her dormitory.</li></ul></li><li class='answer-the-questions-section' answer-index='0'> What did the nurse bring into the room? <ul class='ul-choose-answer'><li>a. A glass of juice </li><li>b. The secretary </li><li>c. Sue’s physics test </li><li>d. A vision chart</li></ul></li><li class='answer-the-questions-section' answer-index='1'> According to the passage, what was obvious to the nurse after seeing Sue? <ul class='ul-choose-answer'><li>a. Sue had committed herself to learning. </li><li>b. Sue had exhausted herself.</li><li>c. Sue had done only a portion of the test. </li><li>d. Sue had become blind.</li></ul></li><li class='answer-the-questions-textarea' value='Working so hard could have severe results for Sue.'>As they chatted, what did the nurse say would cause Sue severe sickness? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>Working so hard could have severe results for Sue.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Lucky Knife",
            "story": "<p>I&rsquo;ve <strong class='idiom-tip' idx='5'>devoted </strong>my life to studying past <strong class='idiom-tip' idx='13'>generations</strong>. Last year, I had a <strong class='idiom-tip' idx='19'>unique </strong>chance to work with my uncle. Our job was to find old treasures for a school&rsquo;s history <strong class='idiom-tip' idx='12'>foundation</strong>. He also hired a <strong class='idiom-tip' idx='4'>crew </strong>of students. They signed a <strong class='idiom-tip' idx='3'>contract </strong>to work with him. He was the <strong class='idiom-tip' idx='1'>boss</strong>. The place was strange, though. I <strong class='idiom-tip' idx='7'>dined </strong>on many things that I had never tasted before. They had an unusual <strong class='idiom-tip' idx='11'>flavor</strong>.</p><p>We had been there about a month and hadn&rsquo;t found anything. One day, I began to <strong class='idiom-tip' idx='6'>dig </strong>in the <strong class='idiom-tip' idx='18'>soil</strong>. The ground&rsquo;s <strong class='idiom-tip' idx='15'>layers </strong>got wetter. Soon I was digging in the <strong class='idiom-tip' idx='16'>mud</strong>. My shovel began to get very heavy. It felt like it had <strong class='idiom-tip' idx='9'>doubled </strong>in weight because the ground had <strong class='idiom-tip' idx='0'>absorbed </strong>a lot of water.</p><p>Finally, I saw something in the mud. It was an old knife! The <strong class='idiom-tip' idx='14'>handle </strong>felt smooth in my hand. I <strong class='idiom-tip' idx='10'>elevated </strong>it so I could see it better. There was writing on it.</p><p>&ldquo;It says it will bring good luck,&rdquo; my uncle said with a smile. &ldquo;Why don&rsquo;t you keep it?&rdquo;</p><p>I put it in my tent. The next day, we found many more things. There were pots, jewelry and weapons. My uncle <strong class='idiom-tip' idx='8'>donated </strong>all of the things to a special <strong class='idiom-tip' idx='2'>committee</strong>. Many newspapers wrote stories about it. It seemed the knife really did bring good luck!</p>",
            "vi": "<p>Tôi đã <strong class='idiom-tip' idx='5'>dành</strong> cả đời mình để nghiên cứu các thế hệ trước. Năm ngoái, tôi có một cơ hội <strong class='idiom-tip' idx='19'>đặc biệt</strong> để làm việc với chú tôi. Công việc của chúng tôi là tìm kiếm những kho báu cũ cho một <strong class='idiom-tip' idx='12'>quỹ</strong> lịch sử của trường. Ông cũng thuê một <strong class='idiom-tip' idx='4'>đội</strong> sinh viên. Họ đã ký một <strong class='idiom-tip' idx='3'>hợp đồng</strong> để làm việc với ông. Ông là <strong class='idiom-tip' idx='1'>sếp</strong>. Tuy nhiên, nơi đó rất lạ lùng. Tôi đã <strong class='idiom-tip' idx='7'>ăn</strong> nhiều món mà tôi chưa bao giờ nếm trước đây. Chúng có một <strong class='idiom-tip' idx='11'>hương vị</strong> kỳ lạ.</p> <p>Chúng tôi đã ở đó khoảng một tháng và chưa tìm thấy gì. Một ngày nọ, tôi bắt đầu <strong class='idiom-tip' idx='6'>đào</strong> trong <strong class='idiom-tip' idx='18'>đất</strong>. Các <strong class='idiom-tip' idx='15'>lớp</strong> đất ngày càng ẩm. Sớm thôi, tôi đã đào trong <strong class='idiom-tip' idx='16'>bùn</strong>. Cái xẻng của tôi bắt đầu trở nên rất nặng. Nó cảm giác như đã <strong class='idiom-tip' idx='9'>tăng gấp đôi</strong> trọng lượng vì đất đã <strong class='idiom-tip' idx='0'>hấp thụ</strong> nhiều nước.</p> <p>Cuối cùng, tôi thấy một cái gì đó trong bùn. Đó là một con dao cũ! <strong class='idiom-tip' idx='14'>Cán</strong> của nó cảm giác mịn màng trong tay tôi. Tôi <strong class='idiom-tip' idx='10'>nâng</strong> nó lên để tôi có thể nhìn rõ hơn. Trên đó có chữ viết.</p> <p>“Nó nói rằng nó sẽ mang lại may mắn,” chú tôi nói với một nụ cười. “Tại sao bạn không giữ nó?”</p> <p>Tôi đặt nó vào lều của mình. Ngày hôm sau, chúng tôi tìm thấy nhiều món đồ hơn. Có những cái nồi, đồ trang sức và vũ khí. Chú tôi đã <strong class='idiom-tip' idx='8'>tặng</strong> tất cả những món đồ đó cho một <strong class='idiom-tip' idx='2'>ủy ban</strong> đặc biệt. Nhiều tờ báo đã viết về việc đó. Có vẻ như con dao thực sự đã mang lại may mắn!</p>",
            "image": "25432.jpg",
            "sound": "25432.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='0'>What is this story about?<ul class='ul-choose-answer'><li>a. How someone found an old knife</li><li>b. A generation of college students</li><li>c. A crew of committee workers digging in the mud</li><li>d. How a smooth knife handle feels</li></ul></li><li class='answer-the-questions-section' answer-index='3'>All of the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the college students signed a contract</li><li>b. the author&rsquo;s uncle worked for a foundation</li><li>c. the items found at the site were donated</li><li>d. the teen worked double the amount of everyone else</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What is probably true of the teen in the story?<ul class='ul-choose-answer'><li>a. He could not read the writing on the knife.</li><li>b. He held a higher position than the other students.</li><li>c. He had to elevate the knife to see what it was.</li><li>d. He didn&rsquo;t want to devote his time to history.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Where did the teen find the knife?<ul class='ul-choose-answer'><li>a. On top of the soil</li><li>b. Under layers of dirt</li><li>c. In the museum</li><li>d. In his boss&rsquo;s tent</li></ul></li><li class='answer-the-questions-textarea' value='The dirt became heavier because the ground had absorbed a lot of water.'>Why did the dirt become heavier? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>The dirt became heavier because the ground had absorbed a lot of water.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Prince Sam",
            "story": "<p>Sam&rsquo;s mother cooked at the royal palace. One day, he went to work with her. She <strong class='idiom-tip' idx='3'>emphasized </strong>that he should stay in the kitchen. But Sam was bored. Thus, he decided to look around.</p><p>He went around a corner. It <strong class='idiom-tip' idx='16'>shocked </strong>him to see a boy who had a strong <strong class='idiom-tip' idx='10'>likeness </strong>to him. Sam soon <strong class='idiom-tip' idx='14'>recovered</strong>. The other boy stared at him. Then he spoke. &ldquo;Come with me.&rdquo;</p><p>He needed to be <strong class='idiom-tip' idx='13'>rational</strong>. But he couldn&rsquo;t <strong class='idiom-tip' idx='1'>deny </strong>that he wanted to go. So he followed the boy to a <strong class='idiom-tip' idx='0'>chamber</strong>. &ldquo;I am Prince Bertram,&rdquo; the boy said.</p><p>Sam felt <strong class='idiom-tip' idx='17'>shy </strong>talking to a prince. &ldquo;I&rsquo;m Sam.&rdquo;</p><p>&ldquo;Trade places with me.&rdquo; The prince said.</p><p>&ldquo;We can&rsquo;t. My mother will kill me. <strong class='idiom-tip' idx='11'>Moreover</strong>, I don&rsquo;t know anything about being a prince.&rdquo;</p><p>&ldquo;No one will find out,&rdquo; the prince <strong class='idiom-tip' idx='8'>interrupted</strong>. &ldquo;We look the same, and even our <strong class='idiom-tip' idx='7'>gestures </strong>are the same. It will only <strong class='idiom-tip' idx='9'>last </strong>for a week.&rdquo;</p><p>Sam said OK. Soon, Sam&rsquo;s <strong class='idiom-tip' idx='12'>perspective </strong>on being a prince changed. He spent most of his day signing royal <strong class='idiom-tip' idx='2'>documents</strong>. At night, the prince&rsquo;s chamber was cold. He thought he was going to <strong class='idiom-tip' idx='6'>freeze </strong>or get sick with a <strong class='idiom-tip' idx='4'>fever </strong>or the <strong class='idiom-tip' idx='5'>flu</strong>. He was happy when the week ended. So was the prince.</p><p>&ldquo;I didn&rsquo;t know how to do anything,&rdquo; the prince said. &ldquo;I&rsquo;ve always <strong class='idiom-tip' idx='15'>relied </strong>on my servants to do everything for me.&rdquo;</p><p>&ldquo;I think I like being a regular person,&rdquo; Sam said. &ldquo;Being a prince isn&rsquo;t fun.&rdquo; So, they both returned to their normal positions and enjoyed their lives more than before.</p>",
            "vi": "<p>Mẹ của Sam nấu ăn tại cung điện hoàng gia. Một ngày nọ, anh ta đi làm cùng mẹ. Bà <strong class='idiom-tip' idx='3'>nhấn mạnh</strong> rằng anh nên ở trong bếp. Nhưng Sam cảm thấy chán. Vì vậy, anh quyết định đi khám phá xung quanh.</p> <p>Anh ta đi quanh một góc. Nó khiến anh <strong class='idiom-tip' idx='16'>sốc</strong> khi thấy một cậu bé có <strong class='idiom-tip' idx='10'>sự giống</strong> mạnh mẽ với mình. Sam nhanh chóng <strong class='idiom-tip' idx='14'>hồi phục</strong>. Cậu bé kia nhìn chằm chằm vào anh. Sau đó, cậu ta nói, “Đi với tôi.”</p> <p>Anh cần phải <strong class='idiom-tip' idx='13'>hợp lý</strong>. Nhưng anh không thể <strong class='idiom-tip' idx='1'>phủ nhận</strong> rằng anh muốn đi. Vì vậy, anh theo cậu bé đến một <strong class='idiom-tip' idx='0'>buồng</strong>. “Tôi là Hoàng tử Bertram,” cậu bé nói.</p> <p>Sam cảm thấy <strong class='idiom-tip' idx='17'>ngại</strong> khi nói chuyện với một hoàng tử. “Tôi là Sam.”</p> <p>“Trao đổi chỗ với tôi.” Hoàng tử nói.</p> <p>“Chúng tôi không thể. Mẹ tôi sẽ giết tôi. <strong class='idiom-tip' idx='11'>Hơn nữa</strong>, tôi không biết gì về việc trở thành hoàng tử.”</p> <p>“Không ai sẽ phát hiện ra,” hoàng tử <strong class='idiom-tip' idx='8'>ngắt lời</strong>. “Chúng ta trông giống nhau, và thậm chí các <strong class='idiom-tip' idx='7'>cử chỉ</strong> của chúng ta cũng giống nhau. Chỉ <strong class='idiom-tip' idx='9'>kéo dài</strong> một tuần thôi.”</p> <p>Sam đồng ý. Sớm, <strong class='idiom-tip' idx='12'>quan điểm</strong> của Sam về việc trở thành hoàng tử đã thay đổi. Anh dành phần lớn thời gian của mình để ký các <strong class='idiom-tip' idx='2'>tài liệu</strong> hoàng gia. Vào ban đêm, buồng của hoàng tử rất lạnh. Anh nghĩ mình sẽ <strong class='idiom-tip' idx='6'>đóng băng</strong> hoặc bị bệnh sốt <strong class='idiom-tip' idx='4'>cao</strong> hoặc <strong class='idiom-tip' idx='5'>cúm</strong>. Anh vui mừng khi tuần lễ kết thúc. Hoàng tử cũng vậy.</p> <p>“Tôi không biết làm gì cả,” hoàng tử nói. “Tôi luôn <strong class='idiom-tip' idx='15'>dựa</strong> vào các người hầu của tôi để làm mọi việc cho tôi.”</p> <p>“Tôi nghĩ tôi thích trở thành một người bình thường,” Sam nói. “Làm hoàng tử không vui.” Vì vậy, cả hai họ quay trở lại vị trí bình thường của mình và tận hưởng cuộc sống hơn trước.</p>",
            "image": "25459.jpg",
            "sound": "25459.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is the main idea of this story?<ul class='ul-choose-answer'><li>a. A boy who denies that he&rsquo;s a prince</li><li>b. A student who&rsquo;s too shy to talk to a prince</li><li>c. How two boys who bore a likeness to each other traded places</li><li>d. A prince who has a rational perspective</li></ul></li><li class='answer-the-questions-section' answer-index='1'>What happened after Sam ran into the prince?<ul class='ul-choose-answer'><li>a. Sam was too shocked to recover.</li><li>b. The prince stared at Sam.</li><li>c. Sam couldn&rsquo;t talk; thus, he ran away.</li><li>d. Sam made a gesture.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What did Sam think about being a prince?<ul class='ul-choose-answer'><li>a. He thought it was fun while it lasted.</li><li>b. He didn&rsquo;t like it; moreover, he missed his mother.</li><li>c. He liked to rely on the servants at the palace.</li><li>d. He was afraid he would freeze or get a fever or the flu.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>What did the Prince miss when he was being Sam?<ul class='ul-choose-answer'><li>a. Sleeping in his own chamber</li><li>b. Having servants do things for him</li><li>c. Signing all of the official documents</li><li>d. People not emphasizing how important he was</li></ul></li><li class='answer-the-questions-textarea' value='Sam didn’t like the prince’s chamber because it was cold at night.'>Why didn&rsquo;t Sam like the prince&rsquo;s chamber? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>Sam didn’t like the prince’s chamber because it was cold at night.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Henry Ford’s Famous Car",
            "story": "<p>My name is Henry Ford, and I <strong class='idiom-tip' idx='12'>invented </strong>a car called the Model T. I used to watch <strong class='idiom-tip' idx='3'>carriages </strong>on the streets. They fascinated me. Then I got a job as a <strong class='idiom-tip' idx='13'>junior</strong> <strong class='idiom-tip' idx='15'>mechanic</strong>. My father <strong class='idiom-tip' idx='7'>criticized </strong>me. He wanted me to run the farm. But I did not <strong class='idiom-tip' idx='17'>shift </strong>my plans.</p><p>Then I worked for the Detroit Auto Company. But I wanted to make cars using less <strong class='idiom-tip' idx='14'>labor</strong>. That way, there would be fewer <strong class='idiom-tip' idx='9'>expenses</strong>. I started the Ford Motor Company in 1903. At first, the company did not do well. But many people were <strong class='idiom-tip' idx='2'>betting </strong>on my success. I also had a <strong class='idiom-tip' idx='19'>sincere</strong> <strong class='idiom-tip' idx='0'>aim </strong>to make a car that anybody could buy.</p><p>Then, in 1908,1 introduced the Model-T in a <strong class='idiom-tip' idx='10'>formal </strong>ceremony. It <strong class='idiom-tip' idx='6'>confirmed </strong>that I was right: it was possible to build a car my way!</p><p>The Model T <strong class='idiom-tip' idx='8'>differed </strong>from other vehicles. Workers could <strong class='idiom-tip' idx='1'>attach </strong>different parts for cars or trucks. This saved time. One Model T could be put together in 93 minutes. All of them had the same <strong class='idiom-tip' idx='4'>classic </strong>design. They were all the same size and <strong class='idiom-tip' idx='11'>height</strong>. The <strong class='idiom-tip' idx='16'>prime </strong>reason for doing this was to save money.</p><p>Over 19 years, I sold over 15 million Model Ts. This sent a <strong class='idiom-tip' idx='18'>signal </strong>to other companies. People would buy cars to <strong class='idiom-tip' idx='5'>commute </strong>to work if the price was low enough.</p>",
            "vi": "<p>Tên tôi là Henry Ford, và tôi <strong class='idiom-tip' idx='12'>phát minh</strong> ra một chiếc xe hơi gọi là Model T. Tôi thường xem các <strong class='idiom-tip' idx='3'>xe ngựa</strong> trên đường phố. Chúng làm tôi rất thích thú. Sau đó, tôi có một công việc là <strong class='idiom-tip' idx='13'>kỹ thuật viên</strong> <strong class='idiom-tip' idx='15'>junior</strong>. Cha tôi <strong class='idiom-tip' idx='7'>chỉ trích</strong> tôi. Ông muốn tôi điều hành nông trại. Nhưng tôi không <strong class='idiom-tip' idx='17'>thay đổi</strong> kế hoạch của mình.</p> <p>Sau đó, tôi làm việc cho Công ty Ô tô Detroit. Nhưng tôi muốn làm xe hơi với ít <strong class='idiom-tip' idx='14'>lao động</strong> hơn. Như vậy, sẽ có ít <strong class='idiom-tip' idx='9'>chi phí</strong> hơn. Tôi bắt đầu Công ty Ô tô Ford vào năm 1903. Ban đầu, công ty không thành công. Nhưng nhiều người đã <strong class='idiom-tip' idx='2'>cá cược</strong> vào thành công của tôi. Tôi cũng có một <strong class='idiom-tip' idx='19'>mục tiêu chân thành</strong> để làm một chiếc xe mà ai cũng có thể mua được.</p> <p>Rồi, vào năm 1908, tôi giới thiệu Model-T trong một <strong class='idiom-tip' idx='10'>buổi lễ trang trọng</strong>. Nó <strong class='idiom-tip' idx='6'>xác nhận</strong> rằng tôi đã đúng: có thể xây dựng một chiếc xe theo cách của tôi!</p> <p>Model T <strong class='idiom-tip' idx='8'>khác</strong> với các phương tiện khác. Công nhân có thể <strong class='idiom-tip' idx='1'>gắn</strong> các bộ phận khác nhau cho xe hơi hoặc xe tải. Điều này tiết kiệm thời gian. Một Model T có thể được lắp ráp trong 93 phút. Tất cả chúng đều có <strong class='idiom-tip' idx='4'>thiết kế cổ điển</strong> giống nhau. Tất cả đều có kích thước và <strong class='idiom-tip' idx='11'>chiều cao</strong> giống nhau. <strong class='idiom-tip' idx='16'>Lý do chính</strong> để làm như vậy là để tiết kiệm tiền.</p> <p>Trong suốt 19 năm, tôi đã bán được hơn 15 triệu Model T. Điều này gửi một <strong class='idiom-tip' idx='18'>tín hiệu</strong> đến các công ty khác. Người ta sẽ mua xe hơi để <strong class='idiom-tip' idx='5'>di chuyển</strong> đến nơi làm việc nếu giá đủ thấp.</p>",
            "image": "25486.jpg",
            "sound": "25486.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. How Ford attached cars and engines</li><li>b. How Ford aimed to build a better car</li><li>c. Why Ford shifted away from carriages</li><li>d. Why Ford bet on the gasoline engine</li></ul></li><li class='answer-the-questions-section' answer-index='2'>How did the Model T change other car companies?<ul class='ul-choose-answer'><li>a. It confirmed that their expenses were large.</li><li>b. It made workers criticize their bosses about their labor.</li><li>c. It created a signal for them to start making cheaper cars.</li><li>d. It forced car companies to bet on Ford&rsquo;s success.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>In paragraph 1, we can infer that __________.<ul class='ul-choose-answer'><li>a. Ford had a very formal childhood</li><li>b. Ford differed in thought from his father</li><li>c. Ford was not of great height</li><li>d. Ford&rsquo;s father was sincere</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the Model-T had a classic design</li><li>b. people would use cars to commute if they weren&rsquo;t expensive</li><li>c. Ford worked as a junior mechanic</li><li>d. the first vehicle from the Ford Motor Company was a truck</li></ul></li><li class='answer-the-questions-textarea' value='The prime reason was to save money.'>What was the prime reason for making the Model T with one design? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>The prime reason was to save money.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Priest",
            "story": "<p>A young <strong class='idiom-tip' idx='18'>priest </strong>was always sad. He was good at his <strong class='idiom-tip' idx='19'>profession</strong>, but he still had no <strong class='idiom-tip' idx='13'>joy</strong>. He visited a group of wise <strong class='idiom-tip' idx='15'>monks</strong>.</p><p>When he got to the monks&rsquo; house, they <strong class='idiom-tip' idx='11'>greeted </strong>him and let him in. The monks asked the priest, &ldquo;What is the matter?&rdquo; The priest said, &ldquo;I should be happy, but I am not. I don&rsquo;t know what to do.&rdquo; The wise monks <strong class='idiom-tip' idx='17'>paused </strong>for a minute. Then one said, &ldquo;We are <strong class='idiom-tip' idx='4'>convinced </strong>of your <strong class='idiom-tip' idx='9'>faith</strong>. You are a very good priest. But to find joy, you have to do more. Above all, <strong class='idiom-tip' idx='12'>investigate </strong>the <strong class='idiom-tip' idx='8'>elements </strong>of your life that you love.&rdquo; The priest thought that this answer was <strong class='idiom-tip' idx='16'>odd</strong>, but he was <strong class='idiom-tip' idx='5'>curious</strong>.</p><p>The next day, the priest thought about his <strong class='idiom-tip' idx='0'>abilities</strong>. He got a few ideas, and he did not want to delay any longer. He liked to draw, so he made some <strong class='idiom-tip' idx='2'>cartoons</strong>. He also liked to write, so he started a <strong class='idiom-tip' idx='7'>diary</strong>. He was interested in <strong class='idiom-tip' idx='1'>agriculture</strong>, so he planted some <strong class='idiom-tip' idx='10'>grains</strong>. He made jam from berries. He made his own <strong class='idiom-tip' idx='14'>labels </strong>to put on the jars of jam. He painted his <strong class='idiom-tip' idx='3'>ceiling</strong>. The priest learned something. It is not too hard to be happy after all. All one has to do is find things they like doing, and do them!</p>",
            "vi": "<p>Một vị <strong class='idiom-tip' idx='18'>linh mục</strong> trẻ luôn cảm thấy buồn. Ông rất giỏi trong <strong class='idiom-tip' idx='19'>nghề nghiệp</strong> của mình, nhưng ông vẫn không có <strong class='idiom-tip' idx='13'>niềm vui</strong>. Ông đã đến thăm một nhóm <strong class='idiom-tip' idx='15'>tu sĩ</strong> khôn ngoan.</p><p>Khi ông đến nhà các tu sĩ, họ đã <strong class='idiom-tip' idx='11'>chào đón</strong> ông và cho ông vào. Các tu sĩ hỏi vị linh mục, “Có chuyện gì vậy?” Vị linh mục trả lời, “Tôi nên cảm thấy hạnh phúc, nhưng tôi không thấy vậy. Tôi không biết phải làm gì.” Các tu sĩ khôn ngoan đã <strong class='idiom-tip' idx='17'>dừng lại</strong> một lát. Sau đó, một người nói, “Chúng tôi <strong class='idiom-tip' idx='4'>tin chắc</strong> vào <strong class='idiom-tip' idx='9'>đức tin</strong> của bạn. Bạn là một vị linh mục rất tốt. Nhưng để tìm thấy niềm vui, bạn phải làm nhiều hơn nữa. Trên hết, hãy <strong class='idiom-tip' idx='12'>khám phá</strong> các <strong class='idiom-tip' idx='8'>yếu tố</strong> trong cuộc sống của bạn mà bạn yêu thích.” Vị linh mục nghĩ rằng câu trả lời này thật <strong class='idiom-tip' idx='16'>kỳ lạ</strong>, nhưng ông cảm thấy <strong class='idiom-tip' idx='5'>hứng thú</strong>.</p><p>Ngày hôm sau, vị linh mục suy nghĩ về các <strong class='idiom-tip' idx='0'>khả năng</strong> của mình. Ông đã có vài ý tưởng, và ông không muốn trì hoãn thêm nữa. Ông thích vẽ, vì vậy ông đã tạo ra một số <strong class='idiom-tip' idx='2'>tranh biếm họa</strong>. Ông cũng thích viết, vì vậy ông bắt đầu một <strong class='idiom-tip' idx='7'>nhật ký</strong>. Ông có hứng thú với <strong class='idiom-tip' idx='1'>nông nghiệp</strong>, vì vậy ông đã trồng một số <strong class='idiom-tip' idx='10'>hạt ngũ cốc</strong>. Ông làm mứt từ quả mọng. Ông tự làm <strong class='idiom-tip' idx='14'>nhãn</strong> để dán lên các hũ mứt. Ông sơn trần <strong class='idiom-tip' idx='3'>nhà</strong> của mình. Vị linh mục đã học được một điều gì đó. Hóa ra việc hạnh phúc không quá khó. Tất cả những gì cần làm là tìm những việc bạn thích làm và làm chúng!</p>",
            "image": "25552.jpg",
            "sound": "25552.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. Why monks have faith in God</li><li>b. How a priest finds joy</li><li>c. How to investigate odd answers</li><li>d. Why a priest did not like his profession</li></ul></li><li class='answer-the-questions-section' answer-index='2'>Why did the priest go to the monks?<ul class='ul-choose-answer'><li>a. Because he was convinced that he was a fine priest</li><li>b. Because he wanted to greet them</li><li>c. Because he wanted their help</li><li>d. Because he wanted to tell them how happy he became</li></ul></li><li class='answer-the-questions-section' answer-index='0'>After the priest talked to the monks, what did he think about?<ul class='ul-choose-answer'><li>a. His abilities</li><li>b. His curious job</li><li>c. His pauses</li><li>d. His delays</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true of the priest EXCEPT __________.<ul class='ul-choose-answer'><li>a. he painted his ceiling</li><li>b. he tried agriculture and planted grains</li><li>c. he drew cartoons</li><li>d. he forgot to put labels on his jam</li></ul></li><li class='answer-the-questions-textarea' value='The priest got a diary because he liked to write.'>Why did the priest get a diary? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>The priest got a diary because he liked to write. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Mrs. May and the Green Girl",
            "story": "<p>One morning, people from a small town found a little girl by a <strong class='idiom-tip' idx='18'>stream</strong>. She seemed to be wearing a green <strong class='idiom-tip' idx='3'>costume</strong>. As the people got closer, they saw that the girl&rsquo;s skin was green!</p><p>&ldquo;Oh my!&rdquo; The people <strong class='idiom-tip' idx='4'>exclaimed</strong>. &ldquo;What if her <strong class='idiom-tip' idx='12'>motive </strong>for coming to our town is bad? What if she has a strange <strong class='idiom-tip' idx='14'>origin</strong>?&rdquo;</p><p>An old woman <strong class='idiom-tip' idx='11'>kindly </strong>went to her. &ldquo;Look how scared she is. Please,&rdquo; she <strong class='idiom-tip' idx='1'>begged</strong>. &ldquo;Do not <strong class='idiom-tip' idx='16'>reject </strong>her. I will <strong class='idiom-tip' idx='0'>adopt </strong>her.&rdquo;</p><p>There was <strong class='idiom-tip' idx='17'>silence </strong>until the judge spoke. &ldquo;I don&rsquo;t know,&rdquo; he said in a worried <strong class='idiom-tip' idx='19'>tone</strong>. &ldquo;But we cannot <strong class='idiom-tip' idx='7'>forbid </strong>you. I <strong class='idiom-tip' idx='9'>indeed </strong>hope you&rsquo;re not being a fool.&rdquo;</p><p>Mrs. May <strong class='idiom-tip' idx='5'>extended </strong>her hand to the girl. &ldquo;Come with me. I won&rsquo;t hurt you.&rdquo;</p><p>The girl spoke a language Mrs. May didn&rsquo;t know. But she was able to <strong class='idiom-tip' idx='10'>interpret </strong>what the girl was trying to say. Sometimes the girl drew pictures to <strong class='idiom-tip' idx='8'>illustrate </strong>what she meant.</p><p>The green girl was from a place far <strong class='idiom-tip' idx='2'>beyond </strong>the sun. There, people lived in <strong class='idiom-tip' idx='13'>nests </strong>built in trees. They only ate green leaves, which made their skin green.</p><p>&ldquo;Well, you can&rsquo;t just eat leaves,&rdquo; Mrs. May said. She fed the green girl home-cooked meals, and soon the girl wasn&rsquo;t green anymore. The people had a huge <strong class='idiom-tip' idx='15'>reception </strong>to welcome her as a citizen of the town.</p>",
            "vi": "<p>Vào một buổi sáng, người dân từ một thị trấn nhỏ phát hiện một cô gái nhỏ bên một <strong class='idiom-tip' idx='18'>dòng suối</strong>. Cô dường như đang mặc một bộ <strong class='idiom-tip' idx='3'>trang phục</strong> màu xanh lá cây. Khi người dân lại gần, họ thấy làn da của cô gái cũng màu xanh lá cây!</p><p>“Ôi trời!” Người dân <strong class='idiom-tip' idx='4'>kêu lên</strong>. “Nếu <strong class='idiom-tip' idx='12'>động cơ</strong> của cô ấy đến thị trấn của chúng ta là xấu thì sao? Nếu cô ấy có một <strong class='idiom-tip' idx='14'>nguồn gốc</strong> kỳ lạ thì sao?”</p><p>Một bà lão <strong class='idiom-tip' idx='11'>tử tế</strong> đã đến gặp cô. “Nhìn cô ấy sợ hãi kìa. Xin hãy,” bà <strong class='idiom-tip' idx='1'>cầu xin</strong>. “Đừng <strong class='idiom-tip' idx='16'>từ chối</strong> cô ấy. Tôi sẽ <strong class='idiom-tip' idx='0'>nhận nuôi</strong> cô ấy.”</p><p>Đã có sự <strong class='idiom-tip' idx='17'>im lặng</strong> cho đến khi thẩm phán lên tiếng. “Tôi không biết,” ông nói với <strong class='idiom-tip' idx='19'>giọng lo lắng</strong>. “Nhưng chúng tôi không thể <strong class='idiom-tip' idx='7'>cấm</strong> bà. Tôi <strong class='idiom-tip' idx='9'>thực sự</strong> hy vọng bà không phải là kẻ ngu ngốc.”</p><p>Bà May <strong class='idiom-tip' idx='5'>kéo dài</strong> tay ra cho cô gái. “Hãy đi với tôi. Tôi sẽ không làm hại bạn.”</p><p>Cô gái nói một ngôn ngữ mà bà May không biết. Nhưng bà đã có thể <strong class='idiom-tip' idx='10'>giải thích</strong> những gì cô gái đang cố gắng nói. Đôi khi cô gái vẽ những bức tranh để <strong class='idiom-tip' idx='8'>minh họa</strong> những gì cô ấy muốn nói.</p><p>Cô gái xanh lá đến từ một nơi xa <strong class='idiom-tip' idx='2'>vượt ngoài</strong> mặt trời. Ở đó, người dân sống trong <strong class='idiom-tip' idx='13'>tổ</strong> được xây trên cây. Họ chỉ ăn lá xanh, điều đó làm da họ xanh.</p><p>“Chà, bạn không thể chỉ ăn lá,” bà May nói. Bà đã cho cô gái ăn các món ăn nấu tại nhà, và chẳng bao lâu cô gái không còn xanh nữa. Người dân đã tổ chức một <strong class='idiom-tip' idx='15'>buổi tiếp đón</strong> lớn để chào đón cô như một công dân của thị trấn.</p>",
            "image": "25579.jpg",
            "sound": "25579.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. A reception for an old woman</li><li>b. A girl who liked to find nests in the trees</li><li>c. The people in the land beyond the sunset</li><li>d. How a woman kindly took care of a girl</li></ul></li><li class='answer-the-questions-section' answer-index='1'>What are the people trying to do to the green girl?<ul class='ul-choose-answer'><li>a. Beg her to jump into the stream</li><li>b. Make her leave</li><li>c. Forbid her to stay with Mrs. May</li><li>d. Interpret what she was trying to say</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What is true of the green girl in the story?<ul class='ul-choose-answer'><li>a. She was good at drawing illustrating about what she meant.</li><li>b. She was indeed there to bring bad luck.</li><li>c. Her costume turned her skin green.</li><li>d. She asked Mrs. May to adopt her.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did Mrs. May extend her hand to the green girl?<ul class='ul-choose-answer'><li>a. To tell the girl that she was a fool</li><li>b. To show that she indeed had good motives</li><li>c. To exclaim that she didn&rsquo;t want to adopt her</li><li>d. To silence the crowd from hurting the girl</li></ul></li><li class='answer-the-questions-textarea' value='Because he thought that Mrs. May should not adopt the girl.'>Why did the town judge speak in a worried tone? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>b</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>Because he thought that Mrs. May should not adopt the girl.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Albert Einstein",
            "story": "<p>My name is Albert Einstein. Many people know about the great things I&rsquo;ve <strong class='idiom-tip' idx='0'>accomplished</strong>. But I had many <strong class='idiom-tip' idx='3'>barriers </strong>before I became famous.</p><p>I was born in Germany. When I was in <strong class='idiom-tip' idx='6'>elementary </strong>school, I already knew about math and <strong class='idiom-tip' idx='19'>statistics</strong>. When I was a boy, I <strong class='idiom-tip' idx='13'>pretended </strong>to be a great scientist. I loved school, but my life at home was hard. My father lost his job, so my family lived in <strong class='idiom-tip' idx='12'>poverty</strong>. We could not pay the <strong class='idiom-tip' idx='17'>rent </strong>in Germany. We became <strong class='idiom-tip' idx='9'>immigrants </strong>and went to Italy. I finished high school and went to college in Switzerland.</p><p>After college, I began writing about science. I did not reach success in an <strong class='idiom-tip' idx='11'>instant</strong>, though. At first, other scientists did not <strong class='idiom-tip' idx='1'>approve </strong>of my work. They thought I was a <strong class='idiom-tip' idx='7'>failure</strong>. Rising to the <strong class='idiom-tip' idx='14'>rank </strong>of an admired scientist was a <strong class='idiom-tip' idx='8'>gradual </strong>process. Soon, people started to notice that I was right. At last, I began to get some <strong class='idiom-tip' idx='15'>recognition</strong>.</p><p>I showed how to find the <strong class='idiom-tip' idx='2'>approximate </strong>size of very big things, like stars. I also <strong class='idiom-tip' idx='4'>detected </strong>and explained the movement of very small things, like atoms. And for fun, I made a machine that could <strong class='idiom-tip' idx='16'>refrigerate </strong>food by <strong class='idiom-tip' idx='10'>inserting </strong>heat. I never <strong class='idiom-tip' idx='18'>retired</strong>. It was my <strong class='idiom-tip' idx='5'>duty </strong>to keep working. I overcame many hard times, and I will be remembered for my important works.</p>",
            "vi": "<p>Tên tôi là Albert Einstein. Nhiều người biết về những điều vĩ đại mà tôi đã <strong class='idiom-tip' idx='0'>hoàn thành</strong>. Nhưng tôi đã gặp nhiều <strong class='idiom-tip' idx='3'>rào cản</strong> trước khi tôi trở nên nổi tiếng.</p><p>Tôi sinh ra ở Đức. Khi tôi học ở <strong class='idiom-tip' idx='6'>trường tiểu học</strong>, tôi đã biết về toán học và <strong class='idiom-tip' idx='19'>thống kê</strong>. Khi còn nhỏ, tôi đã <strong class='idiom-tip' idx='13'>giả vờ</strong> là một nhà khoa học vĩ đại. Tôi yêu thích trường học, nhưng cuộc sống ở nhà thì khó khăn. Cha tôi mất việc, vì vậy gia đình tôi sống trong <strong class='idiom-tip' idx='12'>nghèo đói</strong>. Chúng tôi không thể trả <strong class='idiom-tip' idx='17'>tiền thuê</strong> ở Đức. Chúng tôi trở thành <strong class='idiom-tip' idx='9'>người nhập cư</strong> và đi đến Ý. Tôi hoàn thành trung học và vào đại học ở Thụy Sĩ.</p><p>Sau khi tốt nghiệp, tôi bắt đầu viết về khoa học. Tôi không đạt được thành công ngay lập tức <strong class='idiom-tip' idx='11'>ngay lập tức</strong>. Ban đầu, các nhà khoa học khác không <strong class='idiom-tip' idx='1'>chấp thuận</strong> công trình của tôi. Họ nghĩ tôi là một <strong class='idiom-tip' idx='7'>kẻ thất bại</strong>. Đạt đến <strong class='idiom-tip' idx='14'>vị trí</strong> của một nhà khoa học được ngưỡng mộ là một quá trình <strong class='idiom-tip' idx='8'>dần dần</strong>. Chẳng bao lâu, mọi người bắt đầu nhận thấy rằng tôi đã đúng. Cuối cùng, tôi bắt đầu nhận được <strong class='idiom-tip' idx='15'>sự công nhận</strong>.</p><p>Tôi đã chỉ cho cách tìm kích thước <strong class='idiom-tip' idx='2'>khoảng</strong> của những thứ rất lớn, như các ngôi sao. Tôi cũng <strong class='idiom-tip' idx='4'>phát hiện</strong> và giải thích sự chuyển động của những thứ rất nhỏ, như các nguyên tử. Và để giải trí, tôi đã chế tạo một máy có thể <strong class='idiom-tip' idx='16'>làm lạnh</strong> thực phẩm bằng cách <strong class='idiom-tip' idx='10'>chèn</strong> nhiệt. Tôi không bao giờ <strong class='idiom-tip' idx='18'>nghỉ hưu</strong>. Đó là <strong class='idiom-tip' idx='5'>nghĩa vụ</strong> của tôi để tiếp tục làm việc. Tôi đã vượt qua nhiều thời kỳ khó khăn, và tôi sẽ được nhớ đến vì những công trình quan trọng của mình.</p>",
            "image": "25606.jpg",
            "sound": "25606.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. How Einstein got instant recognition</li><li>b. Why Einstein was a failure at first</li><li>c. How Einstein got past barriers to accomplish many great things</li><li>d. Why Einstein pretended to be sick while in elementary school</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did Einstein&rsquo;s family become immigrants?<ul class='ul-choose-answer'><li>a. They were unhappy about new developments in math and statistics.</li><li>b. They couldn&rsquo;t pay their rent in Germany and had to leave.</li><li>c. His parents didn&rsquo;t want him to stay in school.</li><li>d. They wanted Einstein to go to college in Switzerland.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>Why was Einstein&rsquo;s rise in the ranks of scientists gradual?<ul class='ul-choose-answer'><li>a. Einstein did not write down his ideas.</li><li>b. Einstein&rsquo;s ideas could not be proven.</li><li>c. Other scientists already knew about his ideas.</li><li>d. Other scientists didn&rsquo;t approve of his ideas at first.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, all the following are true about Einstein EXCEPT __________.<ul class='ul-choose-answer'><li>a. he found the approximate size of stars</li><li>b. he refrigerated food by inserting heat as a power source</li><li>c. he had a duty to retire</li><li>d. he detected the movement of atoms</li></ul></li><li class='answer-the-questions-textarea' value='Albert’s family lived in poverty because his father lost his job.'>Why did Albert&rsquo;s family live in poverty? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>Albert’s family lived in poverty because his father lost his job. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "From the Earth to the Stars",
            "story": "<p>Jeremy was from a family of <strong class='idiom-tip' idx='7'>miners</strong>. Like them, he worked <strong class='idiom-tip' idx='19'>underground </strong>during the day. His job was to gather <strong class='idiom-tip' idx='13'>raw</strong> <strong class='idiom-tip' idx='8'>minerals </strong>and <strong class='idiom-tip' idx='6'>jewels</strong>. Each night after work, he lay <strong class='idiom-tip' idx='1'>awake </strong>in an open field. With his <strong class='idiom-tip' idx='18'>telescope</strong>, he looked at the stars. He was amazed by the <strong class='idiom-tip' idx='15'>scale </strong>of space. He wished someday he might travel there.</p><p>One day there was an accident in the mine. Water <strong class='idiom-tip' idx='11'>poured </strong>into the mine. Everything was dark. Jeremy <strong class='idiom-tip' idx='17'>stretched </strong>out and grabbed a piece of wood. It kept him from sinking. Jeremy felt a <strong class='idiom-tip' idx='12'>presence </strong>nearby.</p><p>&ldquo;I am an angel,&rdquo; said a voice.</p><p>&ldquo;What?&rdquo; Jeremy exclaimed.</p><p>&ldquo;You must never come underground again. Have the <strong class='idiom-tip' idx='2'>courage </strong>to make your wishes come true.&rdquo;</p><p>For a long time he <strong class='idiom-tip' idx='3'>floated </strong>in silence. Then he heard other voices. The other miners were coming to rescue him.</p><p>The next day Jeremy <strong class='idiom-tip' idx='16'>skipped </strong>work. He decided to become an <strong class='idiom-tip' idx='0'>astronaut</strong>. For the next two years, he studied hard. One day, he was given <strong class='idiom-tip' idx='10'>permission </strong>to <strong class='idiom-tip' idx='9'>participate </strong>in a mission to space. His wish had been <strong class='idiom-tip' idx='4'>granted</strong>.</p><p>His spaceship left the ground. It went higher until there was no more <strong class='idiom-tip' idx='5'>gravity</strong>. He saw <strong class='idiom-tip' idx='14'>satellites </strong>floating next to the ship.</p><p>Then Jeremy saw a beautiful angel outside his spaceship. It smiled at Jeremy. For some minutes, Jeremy could not speak. Finally, he said, &ldquo;Thankyou.&rdquo;</p>",
            "vi": "<p>Jeremy đến từ một gia đình <strong class='idiom-tip' idx='7'>thợ mỏ</strong>. Giống như họ, anh làm việc <strong class='idiom-tip' idx='19'>dưới lòng đất</strong> trong suốt cả ngày. Công việc của anh là thu thập <strong class='idiom-tip' idx='13'>khoáng sản</strong> thô và <strong class='idiom-tip' idx='8'>đá quý</strong>. Mỗi đêm sau giờ làm việc, anh nằm <strong class='idiom-tip' idx='1'>thức</strong> trên một cánh đồng mở. Với <strong class='idiom-tip' idx='18'>kính viễn vọng</strong> của mình, anh nhìn lên các vì sao. Anh cảm thấy kinh ngạc trước <strong class='idiom-tip' idx='15'>quy mô</strong> của không gian. Anh ước một ngày nào đó mình có thể du hành đến đó.</p><p>Một ngày, đã xảy ra một tai nạn trong mỏ. Nước đã <strong class='idiom-tip' idx='11'>chảy vào</strong> mỏ. Mọi thứ trở nên tối tăm. Jeremy <strong class='idiom-tip' idx='17'>vươn</strong> tay ra và nắm lấy một khúc gỗ. Nó giữ anh không bị chìm. Jeremy cảm thấy một <strong class='idiom-tip' idx='12'>sự hiện diện</strong> gần đó.</p><p>“Tôi là một thiên thần,” một giọng nói nói.</p><p>“Cái gì?” Jeremy <strong class='idiom-tip' idx='13'>kêu lên</strong>.</p><p>“Bạn phải không bao giờ xuống mỏ nữa. Hãy có <strong class='idiom-tip' idx='2'>dũng cảm</strong> để biến những ước mơ của bạn thành hiện thực.”</p><p>Anh <strong class='idiom-tip' idx='3'>nổi</strong> trong im lặng một thời gian. Sau đó, anh nghe thấy những giọng nói khác. Các thợ mỏ khác đang đến để cứu anh.</p><p>Ngày hôm sau, Jeremy <strong class='idiom-tip' idx='16'>bỏ</strong> việc. Anh quyết định trở thành một <strong class='idiom-tip' idx='0'>phi hành gia</strong>. Trong hai năm tiếp theo, anh học tập chăm chỉ. Một ngày, anh được <strong class='idiom-tip' idx='10'>cho phép</strong> <strong class='idiom-tip' idx='9'>tham gia</strong> vào một nhiệm vụ không gian. Ước mơ của anh đã được <strong class='idiom-tip' idx='4'>đáp ứng</strong>.</p><p>Con tàu vũ trụ của anh đã rời khỏi mặt đất. Nó bay cao hơn cho đến khi không còn <strong class='idiom-tip' idx='5'>trọng lực</strong>. Anh thấy các <strong class='idiom-tip' idx='14'>vệ tinh</strong> trôi nổi bên cạnh tàu.</p><p>Rồi Jeremy thấy một thiên thần xinh đẹp bên ngoài tàu vũ trụ của mình. Nó mỉm cười với Jeremy. Trong vài phút, Jeremy không thể nói được. Cuối cùng, anh nói, “Cảm ơn bạn.”</p>",
            "image": "25633.jpg",
            "sound": "25633.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. Why satellites are useful</li><li>b. How a man escaped gravity</li><li>c. Why a telescope is a useful thing</li><li>d. How a miner became an astronaut</li></ul></li><li class='answer-the-questions-section' answer-index='2'>Why did Jeremy stop going underground?<ul class='ul-choose-answer'><li>a. It kept him awake all night long.</li><li>b. He could not find any jewels or minerals.</li><li>c. An angel told him to stop working there and make his dreams come true.</li><li>d. He stopped having the courage to skip work.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>In the second paragraph, we can infer that Jeremy __________.<ul class='ul-choose-answer'><li>a. did not know how to float</li><li>b. could not see the angel</li><li>c. broke the pipe by accident</li><li>d. felt the presence of the workers</li></ul></li><li class='answer-the-questions-section' answer-index='0'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. Jeremy was granted permission to leave the mine</li><li>b. Jeremy used a telescope to watch the stars</li><li>c. Jeremy stretched out to grab the wood</li><li>d. Jeremy was amazed by the scale of space</li></ul></li><li class='answer-the-questions-textarea' value='He participated in a mission to outer space.'>What did Jeremy participate in after finishing astronaut school? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>a</li><li class='answer-key'>He participated in a mission to outer space.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Farm Festival",
            "story": "<p>Once there was a farm. Many animals lived there. One day, they had a <strong class='idiom-tip' idx='6'>contest </strong>in the <strong class='idiom-tip' idx='19'>yard</strong>. They were going to race from the barn to the farmer&rsquo;s <strong class='idiom-tip' idx='8'>garage</strong>. The barn and the garage were far apart. It would be a long race. The winner <strong class='idiom-tip' idx='11'>qualified </strong>to win a bag full of apples as an <strong class='idiom-tip' idx='3'>award</strong>.</p><p>But the race did not start well. The cart with all the apples was not <strong class='idiom-tip' idx='17'>stable</strong>, and the animals had to <strong class='idiom-tip' idx='12'>repair </strong>it. Then the pup knocked over the apples. The pig yelled, &ldquo;We are going to <strong class='idiom-tip' idx='15'>slip</strong>! We must clean up this mess.&rdquo; The <strong class='idiom-tip' idx='10'>pup </strong>felt bad, and she began to cry. The dog gave her a <strong class='idiom-tip' idx='18'>tissue</strong> to wipe her tears.</p><p>Then the race <strong class='idiom-tip' idx='13'>resumed</strong>. But the duck tried to <strong class='idiom-tip' idx='14'>rob </strong>them and take all the apples. The cat said, &ldquo;I will have you <strong class='idiom-tip' idx='2'>arrested</strong>!&rdquo; The duck said, &ldquo;You can&rsquo;t <strong class='idiom-tip' idx='7'>convict </strong>me! You can&rsquo;t prove I took it.&rdquo; The race stopped yet again.</p><p>The animals tried to race one more time. Then they heard an <strong class='idiom-tip' idx='0'>alarm </strong>coming from the barn. There was a fire! They got <strong class='idiom-tip' idx='5'>buckets </strong>of water to put out the fire. A <strong class='idiom-tip' idx='9'>journalist </strong>came to write a story about the festival and the race. The horse told her, &ldquo;I am a special <strong class='idiom-tip' idx='4'>breed </strong>of horse. I would have won the race easily.&rdquo; The pig said, &ldquo;It was <strong class='idiom-tip' idx='16'>somewhat </strong>hard to have the race. But we had fun. That is what&rsquo;s important!&rdquo;</p>",
            "vi": "<p>Ngày xửa ngày xưa có một trang trại. Nhiều con vật sống ở đó. Một ngày, họ đã tổ chức một <strong class='idiom-tip' idx='6'>cuộc thi</strong> trong <strong class='idiom-tip' idx='19'>sân</strong>. Họ sẽ chạy đua từ chuồng bò đến <strong class='idiom-tip' idx='8'>gara</strong> của người nông dân. Chuồng bò và gara cách xa nhau. Đó sẽ là một cuộc đua dài. Người chiến thắng sẽ <strong class='idiom-tip' idx='11'>đủ điều kiện</strong> để nhận một túi đầy táo như một <strong class='idiom-tip' idx='3'>phần thưởng</strong>.</p><p>Tuy nhiên, cuộc đua không bắt đầu suôn sẻ. Xe chở tất cả táo không <strong class='idiom-tip' idx='17'>ổn định</strong>, và các con vật phải <strong class='idiom-tip' idx='12'>sửa chữa</strong> nó. Sau đó, chú chó con đã làm đổ táo. Con lợn kêu lên, “Chúng ta sẽ <strong class='idiom-tip' idx='15'>trượt</strong>! Chúng ta phải dọn dẹp đống hỗn độn này.” Chú chó con cảm thấy tội lỗi, và nó bắt đầu khóc. Con chó đã đưa cho nó một <strong class='idiom-tip' idx='18'>khăn giấy</strong> để lau nước mắt.</p><p>Sau đó, cuộc đua <strong class='idiom-tip' idx='13'>tiếp tục</strong>. Nhưng con vịt cố gắng <strong class='idiom-tip' idx='14'>cướp</strong> tất cả táo. Con mèo nói, “Tôi sẽ khiến bạn bị <strong class='idiom-tip' idx='2'>bắt giữ</strong>!” Con vịt nói, “Bạn không thể <strong class='idiom-tip' idx='7'>kết tội</strong> tôi! Bạn không thể chứng minh tôi đã lấy chúng.” Cuộc đua lại bị dừng lại.</p><p>Các con vật cố gắng chạy đua một lần nữa. Rồi họ nghe thấy một <strong class='idiom-tip' idx='0'>cảnh báo</strong> từ chuồng bò. Có một đám cháy! Họ lấy <strong class='idiom-tip' idx='5'>xô</strong> nước để dập tắt đám cháy. Một <strong class='idiom-tip' idx='9'>nhà báo</strong> đến để viết một câu chuyện về lễ hội và cuộc đua. Con ngựa nói với cô ấy, “Tôi là một <strong class='idiom-tip' idx='4'>giống đặc biệt</strong> của ngựa. Tôi sẽ dễ dàng thắng cuộc đua.” Con lợn nói, “Cuộc đua hơi <strong class='idiom-tip' idx='16'>khó khăn</strong> nhưng chúng tôi đã có niềm vui. Đó mới là điều quan trọng!”</p>",
            "image": "25659.jpg",
            "sound": "25659.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='3'>What is this story about?<ul class='ul-choose-answer'><li>a. Why contests have awards</li><li>b. How a special breed of racehorse would&rsquo;ve won the race</li><li>c. Why animals have to repair things on a farm</li><li>d. How animals had trouble during a race</li></ul></li><li class='answer-the-questions-section' answer-index='0'>When the cart with the apples fell over, why did the animals stop running?<ul class='ul-choose-answer'><li>a. Because they did not want to slip on the apples</li><li>b. Because they had to find tissue</li><li>c. Because they did not want to resume the race</li><li>d. Because the yard was far apart</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What did the duck do wrong?<ul class='ul-choose-answer'><li>a. He was arrested and convicted of stealing a bag of money.</li><li>b. He stole the bucket.</li><li>c. He tried to steal the award.</li><li>d. He set the garage on fire.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the alarm sounded when there was a fire</li><li>b. the animals were somewhat angry</li><li>c. the cart was not stable</li><li>d. a journalist wrote about the festival</li></ul></li><li class='answer-the-questions-textarea' value='The race was going to be from the barn to the farmer’s garage.'>How far was the race going to be? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>b</li><li class='answer-key'>The race was going to be from the barn to the farmer&rsquo;s garage.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Clever Thief",
            "story": "<p>A new king <strong class='idiom-tip' idx='10'>inherited </strong>a lot of gold. He loved his gold very much. He even wanted to keep it after he died. Therefore, he had a large <strong class='idiom-tip' idx='18'>tomb </strong>built for himself and his riches.</p><p>However, the tomb&rsquo;s builder had a plan. Most of the stones were <strong class='idiom-tip' idx='15'>solid</strong>, but he put one special stone on the <strong class='idiom-tip' idx='13'>roof</strong>. It was made of a lighter <strong class='idiom-tip' idx='17'>substance</strong>.</p><p>When the tomb was done, the king moved in his <strong class='idiom-tip' idx='16'>stock </strong>of gold. One night, the builder went to the tomb. His <strong class='idiom-tip' idx='8'>excitement</strong> <strong class='idiom-tip' idx='12'>mounted</strong>. Because all the stones looked <strong class='idiom-tip' idx='0'>alike</strong>, he had left a <strong class='idiom-tip' idx='5'>distinct </strong>mark on the <strong class='idiom-tip' idx='3'>artificial </strong>block. The mark helped him <strong class='idiom-tip' idx='6'>distinguish </strong>the difference in the <strong class='idiom-tip' idx='2'>architecture</strong>.</p><p>The builder lifted the stone. Using a <strong class='idiom-tip' idx='4'>chain</strong>, he climbed into the tomb. He filled his pockets with gold.</p><p>The builder followed this <strong class='idiom-tip' idx='11'>manner </strong>night after night. Soon, the king noticed a <strong class='idiom-tip' idx='14'>shortage </strong>in his gold. This <strong class='idiom-tip' idx='1'>annoyed </strong>the king.</p><p>At last he hired a guard to hide inside the tomb. When the builder entered the tomb, the guard <strong class='idiom-tip' idx='19'>wounded </strong>him. He climbed a pole to the roof. The builder left drops of blood in the <strong class='idiom-tip' idx='7'>dust</strong>. The guard followed them and caught him.</p><p>When the builder <strong class='idiom-tip' idx='9'>healed</strong>, he explained to the king that he didn&rsquo;t keep any of the gold. He had given it all away to the poor.</p>",
            "vi": "<p>Nhà vua mới <strong class='idiom-tip' idx='10'>thừa kế</strong> một lượng vàng lớn. Ông rất yêu thích vàng của mình. Ông thậm chí còn muốn giữ nó sau khi chết. Do đó, ông đã cho xây một <strong class='idiom-tip' idx='18'>lăng mộ</strong> lớn cho bản thân và của cải của mình.</p><p>Tuy nhiên, người xây dựng lăng mộ có một kế hoạch. Hầu hết các viên đá đều <strong class='idiom-tip' idx='15'>vững chắc</strong>, nhưng ông đã đặt một viên đá đặc biệt trên <strong class='idiom-tip' idx='13'>mái</strong>. Nó được làm từ một <strong class='idiom-tip' idx='17'>chất liệu</strong> nhẹ hơn.</p><p>Khi lăng mộ hoàn thành, nhà vua chuyển <strong class='idiom-tip' idx='16'>kho</strong> vàng của mình vào. Một đêm, người xây dựng lăng mộ đã đến lăng mộ. Sự <strong class='idiom-tip' idx='8'>hứng thú</strong> của ông <strong class='idiom-tip' idx='12'>tăng cao</strong>. Vì tất cả các viên đá trông <strong class='idiom-tip' idx='0'>giống nhau</strong>, ông đã để lại một <strong class='idiom-tip' idx='5'>dấu hiệu</strong> đặc biệt trên viên đá <strong class='idiom-tip' idx='3'>nhân tạo</strong>. Dấu hiệu giúp ông <strong class='idiom-tip' idx='6'>phân biệt</strong> sự khác biệt trong <strong class='idiom-tip' idx='2'>kiến trúc</strong>.</p><p>Người xây dựng lăng mộ đã nâng viên đá lên. Sử dụng một <strong class='idiom-tip' idx='4'>dây xích</strong>, ông leo vào trong lăng mộ. Ông đã nhét đầy túi của mình bằng vàng.</p><p>Người xây dựng lăng mộ làm theo cách này <strong class='idiom-tip' idx='11'>đêm này qua đêm</strong>. Sớm muộn, nhà vua nhận thấy có một <strong class='idiom-tip' idx='14'>sự thiếu hụt</strong> vàng của mình. Điều này đã khiến nhà vua <strong class='idiom-tip' idx='1'>bực mình</strong>.</p><p>Cuối cùng, ông đã thuê một lính gác để ẩn nấp trong lăng mộ. Khi người xây dựng lăng mộ vào lăng mộ, lính gác đã <strong class='idiom-tip' idx='19'>làm bị thương</strong> ông. Ông leo lên một cái cột đến mái lăng mộ. Người xây dựng lăng mộ để lại những giọt máu trong <strong class='idiom-tip' idx='7'>bụi</strong>. Lính gác đã theo dấu và bắt được ông.</p><p>Khi người xây dựng lăng mộ hồi phục, ông giải thích với nhà vua rằng ông không giữ bất kỳ vàng nào. Ông đã cho toàn bộ số vàng cho người nghèo.</p>",
            "image": "25685.jpg",
            "sound": "25685.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. The manner in which a king inherited his riches</li><li>b. Different kinds of architecture</li><li>c. How a builder tricked a king</li><li>d. Why a tomb had a large pole</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What distinguished the artificial block from the real blocks?<ul class='ul-choose-answer'><li>a. A distinct mark on one of the blocks</li><li>b. The different color of its substance</li><li>c. The amount of dust on it</li><li>d. The solid gold pieces in it</li></ul></li><li class='answer-the-questions-section' answer-index='3'>How did the king know his gold was missing?<ul class='ul-choose-answer'><li>a. He found a chain in the tomb.</li><li>b. There was a hole in the roof.</li><li>c. There was a shortage of guards.</li><li>d. His stock of gold had decreased.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>The builder was caught because __________.<ul class='ul-choose-answer'><li>a. he and another man looked alike</li><li>b. he mounted the wrong tomb</li><li>c. a guard wounded him</li><li>d. he stopped to heal the king&rsquo;s wound</li></ul></li><li class='answer-the-questions-textarea' value='The king was annoyed because he didn't know how the gold could be gone.'>Why was the king annoyed? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>The king was annoyed because he didn&#39;t know how the gold could be gone.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Doctor’s Cure",
            "story": "<p>James Fry was a <strong class='idiom-tip' idx='4'>fantastic </strong>doctor. His <strong class='idiom-tip' idx='17'>surgeries </strong>helped many <strong class='idiom-tip' idx='3'>disabled </strong>people <strong class='idiom-tip' idx='12'>overcome </strong>their injuries. He also wrote for a popular medical <strong class='idiom-tip' idx='8'>journal</strong>. James was very busy. His son, Steve, rarely saw him.</p><p>One day, James was walking and <strong class='idiom-tip' idx='7'>inspecting </strong>a patient&rsquo;s file. There was water all over the floor. James slipped on the <strong class='idiom-tip' idx='9'>liquid </strong>and fell. He fell on a broken glass <strong class='idiom-tip' idx='19'>tube</strong>. He was hurt.</p><p>Steve came to visit him in the hospital. James said, &ldquo;It will be <strong class='idiom-tip' idx='18'>tough </strong>for me to stay in bed. But I can hardly <strong class='idiom-tip' idx='1'>bend </strong>my legs.&rdquo;</p><p>&ldquo;Then let&rsquo;s watch a movie.&rdquo; Steve said. It made them laugh together. Steve said, &ldquo;I have to leave, but here&rsquo;s some <strong class='idiom-tip' idx='5'>fiction </strong>to read.&rdquo;</p><p>James started to <strong class='idiom-tip' idx='13'>recall </strong>fun parts of life. He <strong class='idiom-tip' idx='10'>marveled </strong>at small things, like food. He was too busy to notice them before. &ldquo;Steve,&rdquo; he said, &ldquo;you get more <strong class='idiom-tip' idx='11'>nutrients </strong>when you <strong class='idiom-tip' idx='2'>chew </strong>slowly. But I think it makes food taste better, too!&rdquo;</p><p>Weeks later, James said, &ldquo;Steve, I haven&rsquo;t spent enough time with you. I <strong class='idiom-tip' idx='14'>regret </strong>this. Even my <strong class='idiom-tip' idx='15'>soul </strong>feels better when you visit. But I have spent <strong class='idiom-tip' idx='16'>sufficient </strong>time here. We should go home.&rdquo;</p><p>Outside, there was a warm breeze. James watched a <strong class='idiom-tip' idx='6'>flag </strong>blow.</p><p>Finally, James said, &ldquo;I&rsquo;m not ready to work. I&rsquo;m going to take a long <strong class='idiom-tip' idx='0'>bath</strong>. And then we&rsquo;ll watch a movie together.&rdquo;</p>",
            "vi": "<p>James Fry là một bác sĩ tuyệt vời. Những ca phẫu thuật của ông đã giúp nhiều người khuyết tật vượt qua chấn thương của họ. Ông cũng viết cho một tạp chí y khoa nổi tiếng. James rất bận rộn. Con trai ông, Steve, hiếm khi thấy ông.</p> <p>Một ngày nọ, James đang đi bộ và kiểm tra hồ sơ của một bệnh nhân. Có nước vương vãi khắp sàn nhà. James bị trượt trên vũng nước và ngã. Ông ngã lên một ống kính bị vỡ. Ông bị thương.</p> <p>Steve đến thăm ông ở bệnh viện. James nói, “Sẽ rất khó khăn cho tôi khi nằm trên giường. Nhưng tôi gần như không thể gập chân của mình.”</p> <p>“Vậy thì chúng ta hãy xem một bộ phim.” Steve nói. Điều đó khiến họ cười cùng nhau. Steve nói, “Tôi phải đi, nhưng đây là một cuốn tiểu thuyết để đọc.”</p> <p>James bắt đầu hồi tưởng những phần vui vẻ của cuộc sống. Ông trầm trồ trước những điều nhỏ nhặt, như thực phẩm. Ông quá bận rộn để chú ý đến chúng trước đây. “Steve,” ông nói, “bạn nhận được nhiều chất dinh dưỡng hơn khi nhai chậm rãi. Nhưng tôi nghĩ điều đó cũng làm cho thực phẩm ngon hơn nữa!”</p> <p>Vài tuần sau, James nói, “Steve, tôi chưa dành đủ thời gian với bạn. Tôi tiếc điều này. Ngay cả linh hồn của tôi cũng cảm thấy tốt hơn khi bạn đến thăm. Nhưng tôi đã ở đây đủ lâu rồi. Chúng ta nên về nhà.”</p> <p>Bên ngoài, có một làn gió ấm áp. James nhìn xem một lá cờ bay.</p> <p>Cuối cùng, James nói, “Tôi chưa sẵn sàng để làm việc. Tôi sẽ tắm một lúc lâu. Và sau đó chúng ta sẽ xem một bộ phim cùng nhau.”</p>",
            "image": "25712.jpg",
            "sound": "25712.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. A doctor who needs surgery</li><li>b. A boy with a fantastic comedy video</li><li>c. A doctor who recalls fun things</li><li>d. A disabled boy who overcomes injuries</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What does James notice now that he isn&rsquo;t busy?<ul class='ul-choose-answer'><li>a. Food tastes better when you chew it slowly.</li><li>b. Reading fiction is tough.</li><li>c. He regrets not working more.</li><li>d. His soul feels worse than before.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>How did James get hurt?<ul class='ul-choose-answer'><li>a. He didn&rsquo;t get enough nutrients.</li><li>b. He slipped and fell on a broken tube.</li><li>c. He didn&rsquo;t spend sufficient time at the hospital.</li><li>d. He slipped on liquid after a bath.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What does James do when he leaves the hospital?<ul class='ul-choose-answer'><li>a. He inspects a patient&rsquo;s file.</li><li>b. He shows Steve that he can bend his legs.</li><li>c. He watches a flag blow in the breeze.</li><li>d. He marvels at the taste of food.</li></ul></li><li class='answer-the-questions-textarea' value='It made them laugh together.'>What did the movie do to James and Steve? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>It made them laugh together.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Criminal",
            "story": "<p>A man had been in jail because he stole things. The <strong class='idiom-tip' idx='5'>criminal </strong>never felt bad. One day, he escaped and ran into the woods. He found a <strong class='idiom-tip' idx='3'>cabin </strong>with a <strong class='idiom-tip' idx='9'>fence</strong>. The cabin was very <strong class='idiom-tip' idx='12'>neat</strong>. Inside, the criminal found a <strong class='idiom-tip' idx='2'>bowl </strong>of fruit, a bottle of milk, and a <strong class='idiom-tip' idx='6'>dozen </strong>eggs. He ate the fruit and drank the milk. But the eggs smelled funny, so he put them in the trash <strong class='idiom-tip' idx='1'>bin</strong>. Soon, he heard the sound of a <strong class='idiom-tip' idx='17'>vehicle</strong>&rsquo;s motor.</p><p>An old man came in and saw the criminal. The old man <strong class='idiom-tip' idx='19'>yelled</strong>, &ldquo;Why are you in my house?&rdquo; The criminal lied, &ldquo;I am a policeman.&rdquo; The old man replied, &ldquo;I am your <strong class='idiom-tip' idx='7'>elder</strong>. You cannot fool me. You are the criminal.&rdquo; The criminal&rsquo;s <strong class='idiom-tip' idx='8'>facial </strong>expression became very sad.</p><p>He <strong class='idiom-tip' idx='0'>admitted </strong>that he was a criminal. He said, &ldquo;I&rsquo;m sorry. It was <strong class='idiom-tip' idx='15'>rude </strong>for me to come into your home. Please take the <strong class='idiom-tip' idx='4'>cash </strong>from my <strong class='idiom-tip' idx='18'>wallet</strong>. It is a <strong class='idiom-tip' idx='11'>mere </strong>amount, but it will <strong class='idiom-tip' idx='16'>settle </strong>our problem.&rdquo; The old man said, &ldquo;I do not want your money. I just want to <strong class='idiom-tip' idx='10'>inspire </strong>you to be good. There will be no <strong class='idiom-tip' idx='14'>penalty </strong>for taking my food.&rdquo;</p><p>On this <strong class='idiom-tip' idx='13'>occasion</strong>, the criminal realized that he had been bad. He listened to the old man and never stole from anyone ever again.</p>",
            "vi": "<p>Một người đàn ông đã bị bỏ tù vì tội ăn cắp. Kẻ phạm tội không bao giờ cảm thấy tội lỗi. Một ngày nọ, hắn trốn thoát và chạy vào rừng. Hắn tìm thấy một cái lều có hàng rào. Cái lều rất ngăn nắp. Bên trong, kẻ phạm tội tìm thấy một bát trái cây, một chai sữa, và một tá trứng. Hắn ăn trái cây và uống sữa. Nhưng trứng có mùi lạ, nên hắn đã bỏ chúng vào thùng rác. Sớm sau đó, hắn nghe thấy tiếng động cơ của một phương tiện.</p> <p>Một người đàn ông lớn tuổi đi vào và thấy kẻ phạm tội. Ông già la lên, “Tại sao bạn lại ở trong nhà tôi?” Kẻ phạm tội đã nói dối, “Tôi là một cảnh sát.” Ông già trả lời, “Tôi là bậc cao niên của bạn. Bạn không thể lừa tôi. Bạn là kẻ phạm tội.” Biểu cảm của kẻ phạm tội trở nên rất buồn bã.</p> <p>Hắn thừa nhận rằng hắn là một kẻ phạm tội. Hắn nói, “Tôi xin lỗi. Thật là thô lỗ khi tôi vào nhà của bạn. Xin hãy lấy tiền từ ví của tôi. Đây là một số tiền nhỏ, nhưng nó sẽ giải quyết vấn đề của chúng ta.” Ông già nói, “Tôi không muốn tiền của bạn. Tôi chỉ muốn truyền cảm hứng cho bạn để trở nên tốt hơn. Không có hình phạt nào cho việc lấy thức ăn của tôi.”</p> <p>Vào dịp này, kẻ phạm tội nhận ra rằng hắn đã hành xử không tốt. Hắn nghe lời ông già và không bao giờ ăn cắp từ ai nữa.</p>",
            "image": "25739.jpg",
            "sound": "25739.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section'  answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. Why elders are smarter than young people</li><li>b. How a criminal changed and learned to be good</li><li>c. Why you should not go to places with fences</li><li>d. Why you should admit when you are rude</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did the old man yell at the criminal?<ul class='ul-choose-answer'><li>a. The old man reported the criminal&rsquo;s penalty to the police.</li><li>b. The old man made an occasion to be bad.</li><li>c. The old man let the criminal go.</li><li>d. The old man took the criminal&rsquo;s money.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>What did the old man do with the criminal at the end of the story?<ul class='ul-choose-answer'><li>a. The old man reported the criminal&rsquo;s penalty to the police.</li><li>b. The old man made an occasion to be bad.</li><li>c. The old man convinced the thief to never steal again.</li><li>d. The old man took the criminal&rsquo;s money.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, the criminal did all of the following EXCEPT __________.<ul class='ul-choose-answer'><li>a. he ate the fruit that was in the bowl</li><li>b. he drank the milk that was in the bottle</li><li>c. he heard the motor from the vehicle</li><li>d. he fell asleep in the cabin</li></ul></li><li class='answer-the-questions-textarea' value='He inspired the criminal to be good and tell the truth.'>What did the old man inspire the criminal to do? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>d</li><li class='answer-key'>He inspired the criminal to be good and tell the truth.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Two Captains",
            "story": "<p>Once there were two ships. Both ships carried <strong class='idiom-tip' idx='4'>cotton</strong>. The captains were very different. Thomas was <strong class='idiom-tip' idx='16'>strict</strong>. He made his crew <strong class='idiom-tip' idx='7'>engage </strong>in difficult <strong class='idiom-tip' idx='18'>tasks</strong>. &ldquo;Make sure the ship&rsquo;s deck is <strong class='idiom-tip' idx='8'>firm </strong>and that nothing falls! Put more <strong class='idiom-tip' idx='9'>fuel </strong>in the tank!&rdquo; he said. His ship was very <strong class='idiom-tip' idx='13'>plain</strong>, but he never had a problem with it.</p><p>The second captain, William, was not serious. He had a <strong class='idiom-tip' idx='10'>grand </strong>ship, and he loved having fun. His crew <strong class='idiom-tip' idx='2'>amused </strong>him by singing and dancing. But his crew never fixed anything on the ship. They just wanted to <strong class='idiom-tip' idx='17'>surf</strong>.</p><p>One day, Thomas saw a <strong class='idiom-tip' idx='11'>hurricane </strong>ahead. He knew that his ship needed to turn around. But he was sure William did not see the storm. He <strong class='idiom-tip' idx='1'>adjusted </strong>the dials on the radio and called his friend. Thomas said, &ldquo;You&rsquo;ll hit the <strong class='idiom-tip' idx='14'>reef</strong>. It&rsquo;s made completely of <strong class='idiom-tip' idx='3'>coral</strong>. Turn around to ensure that you do not <strong class='idiom-tip' idx='5'>crash</strong>.&rdquo;</p><p>William said, &ldquo;We will go under the <strong class='idiom-tip' idx='6'>deck </strong>and <strong class='idiom-tip' idx='15'>shut </strong>the door. We will dance and sing until we are past the danger <strong class='idiom-tip' idx='19'>zone</strong>.&rdquo;</p><p>When William&rsquo;s ship got to the hurricane, the wind blew it into the reef. The ship crashed, and water flowed below the deck. William&rsquo;s crew <strong class='idiom-tip' idx='0'>accused </strong>him of being a bad captain. The <strong class='idiom-tip' idx='12'>loss </strong>of the ship taught William a lesson. There are times to have fun, but there are also times to be serious.</p>",
            "vi": "<p>Ngày xưa có hai con tàu. Cả hai con tàu đều chở bông. Các thuyền trưởng thì rất khác nhau. Thomas rất nghiêm khắc. Ông khiến đoàn thủy thủ của mình tham gia vào các nhiệm vụ khó khăn. “Hãy đảm bảo rằng boong tàu vững chắc và không có gì rơi xuống! Thêm nhiên liệu vào bể chứa!” ông nói. Con tàu của ông rất đơn giản, nhưng ông chưa bao giờ gặp vấn đề với nó.</p> <p>Thuyền trưởng thứ hai, William, thì không nghiêm túc. Ông có một con tàu lớn và ông thích vui chơi. Đoàn thủy thủ của ông làm ông vui bằng cách hát và nhảy múa. Nhưng đoàn thủy thủ của ông không bao giờ sửa chữa gì trên tàu. Họ chỉ muốn lướt sóng.</p> <p>Một ngày nọ, Thomas thấy một cơn bão ở phía trước. Ông biết rằng con tàu của mình cần phải quay lại. Nhưng ông chắc chắn rằng William không thấy cơn bão. Ông điều chỉnh các núm trên radio và gọi bạn mình. Thomas nói, “Bạn sẽ va vào bãi đá ngầm. Nó hoàn toàn bằng san hô. Hãy quay lại để tránh va chạm.”</p> <p>William nói, “Chúng tôi sẽ đi xuống dưới boong tàu và đóng cửa. Chúng tôi sẽ nhảy múa và hát cho đến khi chúng tôi qua khu vực nguy hiểm.”</p> <p>Khi con tàu của William đến cơn bão, gió đã thổi nó vào bãi đá ngầm. Con tàu bị vỡ và nước tràn vào dưới boong tàu. Đoàn thủy thủ của William đã buộc tội ông là thuyền trưởng tồi. Việc mất con tàu đã dạy William một bài học. Có những lúc để vui chơi, nhưng cũng có những lúc để nghiêm túc.</p>",
            "image": "25767.jpg",
            "sound": "25767.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. Why surfing amuses William</li><li>b. How Thomas is too strict to be a captain</li><li>c. Why people should be serious sometimes</li><li>d. Why hurricanes form over the ocean</li></ul></li><li class='answer-the-questions-section' answer-index='0'>Why did Thomas turn his ship around?<ul class='ul-choose-answer'><li>a. He saw the hurricane and did not want to crash.</li><li>b. He wanted to go to the reef.</li><li>c. He could not shut the door.</li><li>d. He wanted to engage in other activities.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did William&rsquo;s crew accuse him of being a bad captain?<ul class='ul-choose-answer'><li>a. William did not go into the storm&rsquo;s danger zone.</li><li>b. William caused the loss of the ship.</li><li>c. He did not succeed in getting the cotton to its destination.</li><li>d. He ensured his crew that they would not crash.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all of the following are true about Thomas EXCEPT __________.<ul class='ul-choose-answer'><li>a. he told his crew to put fuel in the tank</li><li>b. he had his crew make sure the deck was firm</li><li>c. he adjusted the radio dial to call William</li><li>d. he sang and danced to songs from an opera</li></ul></li><li class='answer-the-questions-textarea' value='When his ship reached the hurricane the wind blew it into the reef, and it crashed.'>What happened when William&rsquo;s ship reached the hurricane? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>a</li><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>When his ship reached the hurricane the wind blew it into the reef, and it crashed. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Duke and the Minister",
            "story": "<p>A mean <strong class='idiom-tip' idx='4'>duke </strong>grew <strong class='idiom-tip' idx='17'>tobacco</strong>, and his <strong class='idiom-tip' idx='3'>cardinal </strong>rule was to always keep the plants healthy. The duke&rsquo;s top <strong class='idiom-tip' idx='10'>minister </strong>was his <strong class='idiom-tip' idx='18'>twin </strong>brother. They closely <strong class='idiom-tip' idx='15'>resembled </strong>each other. One day, the tobacco plants started to die. He <strong class='idiom-tip' idx='7'>hired </strong>men to watch the fields. Soon, the men brought a woman to him and said, &ldquo;We <strong class='idiom-tip' idx='2'>captured </strong>a <strong class='idiom-tip' idx='19'>witch</strong>!&rdquo;</p><p>The Duke asked, &ldquo;How do you know?&rdquo;</p><p>&ldquo;She sang magic words. I can&rsquo;t <strong class='idiom-tip' idx='14'>pronounce </strong>them. She has cursed us. The death of the plants is a <strong class='idiom-tip' idx='16'>symptom </strong>of her curse,&rdquo; the men said.</p><p>&ldquo;I am just an <strong class='idiom-tip' idx='11'>ordinary </strong>woman. I was singing a song in a different language,&rdquo; the woman protested.</p><p>The duke didn&rsquo;t listen. &ldquo;You are <strong class='idiom-tip' idx='6'>guilty</strong>. You will go to <strong class='idiom-tip' idx='9'>jail</strong>.&rdquo;</p><p>The minister thought that she was <strong class='idiom-tip' idx='8'>innocent</strong>. He needed to <strong class='idiom-tip' idx='5'>expose </strong>the truth. He asked the duke to loan him one of his plants. He looked at it closely. He saw hundreds of small bugs eating it! Then the minister went to the jail and did something <strong class='idiom-tip' idx='1'>bold</strong>.</p><p>&ldquo;Let this woman go,&rdquo; he said.</p><p>The guards thought he was the duke. They let her go. The minister said, &ldquo;I owe you an <strong class='idiom-tip' idx='0'>apology</strong>.&rdquo;</p><p>&ldquo;Thank you. I thought my stay in jail was <strong class='idiom-tip' idx='12'>permanent</strong>,&rdquo; the woman answered.</p><p>The minister thought the duke would punish him. But he didn&rsquo;t. The duke was too busy trying to <strong class='idiom-tip' idx='13'>preserve </strong>his plants.</p>",
            "vi": "<p> Một công tước độc ác trồng thuốc lá, và quy tắc chính của ông là luôn giữ cho các cây thuốc lá khỏe mạnh. Bộ trưởng hàng đầu của công tước là anh trai sinh đôi của ông. Họ rất giống nhau. Một ngày nọ, các cây thuốc lá bắt đầu chết. Ông thuê người canh gác các cánh đồng. Sớm sau đó, những người này đưa một người phụ nữ đến và nói, “Chúng tôi đã bắt được một phù thủy!”</p> <p>Công tước hỏi, “Làm thế nào bạn biết?”</p> <p>“Cô ấy đã hát những từ ma thuật. Tôi không thể phát âm chúng. Cô ấy đã nguyền rủa chúng ta. Sự chết của các cây là triệu chứng của lời nguyền của cô ấy,” những người đó nói.</p> <p>“Tôi chỉ là một người phụ nữ bình thường. Tôi đang hát một bài hát bằng một ngôn ngữ khác,” người phụ nữ phản đối.</p> <p>Công tước không nghe. “Bạn có tội. Bạn sẽ bị bỏ tù.”</p> <p>Bộ trưởng nghĩ rằng cô ấy vô tội. Ông cần phải làm sáng tỏ sự thật. Ông yêu cầu công tước cho mượn một trong những cây thuốc lá của ông. Ông nhìn kỹ nó. Ông thấy hàng trăm con bọ nhỏ đang ăn nó! Sau đó bộ trưởng đi đến nhà tù và làm điều gì đó táo bạo.</p> <p>“Hãy thả người phụ nữ này ra,” ông nói.</p> <p>Các lính gác nghĩ rằng ông là công tước. Họ đã thả cô ra. Bộ trưởng nói, “Tôi nợ bạn một lời xin lỗi.”</p> <p>“Cảm ơn bạn. Tôi nghĩ rằng thời gian của tôi ở trong tù là vĩnh viễn,” người phụ nữ đáp.</p> <p>Bộ trưởng nghĩ rằng công tước sẽ trừng phạt ông. Nhưng ông không làm vậy. Công tước quá bận rộn với việc giữ cho các cây thuốc lá của mình khỏe mạnh.</p>",
            "image": "25794.jpg",
            "sound": "25794.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. Why the duke was afraid of witches </li><li>b. How a minister did what was right</li><li>c. Why the duke loaned his brother a plant </li><li>d. How a woman was captured and taken to jail</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Why did the duke hire the men to watch the fields? <ul class='ul-choose-answer'><li>a. They had a bold plan to preserve the tobacco. </li><li>b. The tobacco plants were being destroyed. </li><li>c. He needed them to expose the truth. </li><li>d. He wanted permanent guards to watch the farmers.</li></ul></li><li class='answer-the-questions-section' answer-index='1'>Who or what was destroying the tobacco plants? <ul class='ul-choose-answer'><li>a. An ordinary woman </li><li>b. Little bugs </li><li>c. A guilty witch </li><li>d. The symptoms of disease</li></ul></li><li class='answer-the-questions-section' answer-index='2'>According to the passage, all the following are true EXCEPT _________.<ul class='ul-choose-answer'><li>a. the duke and the minister are twins </li><li>b. the minister pretended to be the duke </li><li>c. the duke gave an apology to the innocent woman </li><li>d. the guard said the woman pronounced magic words</li></ul></li><li class='answer-the-questions-textarea' value='They resembled each other because they were twin brothers.'>Why did the duke and the minister resemble each other? <br />_________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>b</li><li class='answer-key'>c</li><li class='answer-key'>They resembled each other because they were twin brothers. </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Fisherman",
            "story": "<p>Every day, a fisherman sat on a <strong class='idiom-tip' idx='4'>bridge</strong>. He ate apples and spit the <strong class='idiom-tip' idx='12'>seeds </strong>into the water. He had a simple way to catch fish. He cut a <strong class='idiom-tip' idx='2'>branch </strong>off of a tree and tied a line to it. He put a <strong class='idiom-tip' idx='13'>sharp </strong>hook on it and made a <strong class='idiom-tip' idx='16'>tight </strong>knot. Then he <strong class='idiom-tip' idx='19'>whispered</strong>, &ldquo;Come here fish.&rdquo; Like magic, the fish bit the hook. He put them in a big <strong class='idiom-tip' idx='9'>net </strong>and took them home to make big <strong class='idiom-tip' idx='11'>pots </strong>of fish soup from them.</p><p>One day, another man walked up to him. He said, &ldquo;My name is George. I am staying at the <strong class='idiom-tip' idx='8'>inn</strong>. I bet that I am a better fisherman than you. I will <strong class='idiom-tip' idx='0'>accompany </strong>you today. I <strong class='idiom-tip' idx='6'>dare </strong>you to prove your skill!&rdquo; The fisherman <strong class='idiom-tip' idx='5'>cast </strong>his line.</p><p>George had a lot of <strong class='idiom-tip' idx='7'>electronic </strong>tools. One machine gave him the <strong class='idiom-tip' idx='17'>virtual </strong>locations offish. His rod <strong class='idiom-tip' idx='18'>weighed </strong>fish.</p><p>At the end of the day, George <strong class='idiom-tip' idx='15'>subtracted </strong>his fish from the fisherman&rsquo;s. The fisherman had beaten him by forty-seven!</p><p>George asked, &ldquo;How do you catch fish with only a branch and a <strong class='idiom-tip' idx='1'>bare </strong>line? I have many different <strong class='idiom-tip' idx='14'>sorts </strong>of tools.&rdquo; The fisherman told George, &ldquo;My <strong class='idiom-tip' idx='10'>philosophy </strong>is simple. I am patient, and I believe in myself. Take a <strong class='idiom-tip' idx='3'>breath</strong>, and try it my way.&rdquo;</p>",
            "vi": "<p>Mỗi ngày, một ngư dân ngồi trên một cây cầu. Ông ăn táo và nhổ hạt vào nước. Ông có một cách đơn giản để bắt cá. Ông cắt một cành cây và buộc một sợi dây vào đó. Ông gắn một cái móc sắc bén vào đó và thắt một nút chặt. Sau đó ông thì thầm, “Đến đây cá.” Như phép màu, cá cắn vào móc câu. Ông cho chúng vào một cái lưới lớn và mang chúng về nhà để làm những nồi súp cá lớn.</p> <p>Một ngày nọ, một người đàn ông khác đến gần ông. Ông ta nói, “Tôi tên là George. Tôi đang ở tại nhà nghỉ. Tôi cá rằng tôi là một ngư dân giỏi hơn bạn. Tôi sẽ đi cùng bạn hôm nay. Tôi thách bạn chứng minh kỹ năng của mình!” Ngư dân quăng dây câu của mình.</p> <p>George có rất nhiều công cụ điện tử. Một máy móc cho ông biết vị trí ảo của cá. Cần câu của ông cân cá.</p> <p>Cuối ngày, George trừ số cá của mình khỏi số cá của ngư dân. Ngư dân đã thắng ông . George đã rất thất vọng. “Tôi đã sử dụng tất cả công cụ điện tử của mình mà vẫn không bắt được cá nhiều hơn bạn!”</p> <p>“Vì vậy, bạn thấy đấy,” ngư dân nói, “đôi khi kỹ năng là điều quan trọng hơn công cụ.”</p>",
            "image": "25820.jpg",
            "sound": "25820.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='1'>What is this story about?<ul class='ul-choose-answer'><li>a. Why fishermen use nets</li><li>b. How a man&rsquo;s philosophy was a good match for fishing</li><li>c. Why George did not like the fisherman</li><li>d. How to whisper to fish</li></ul></li><li class='answer-the-questions-section' answer-index='3'>What did the fisherman do with the fish?<ul class='ul-choose-answer'><li>a. He sold them to a restaurant.</li><li>b. He subtracted the fish.</li><li>c. He made all sorts of food.</li><li>d. He made soup with them.</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What did the fisherman do every day at the bridge?<ul class='ul-choose-answer'><li>a. He would cast his line into the water.</li><li>b. He would take a breath then jump into the river.</li><li>c. He would accompany George from the inn.</li><li>d. He would eat a virtual pot offish soup.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true about the fisherman EXCEPT __________.<ul class='ul-choose-answer'><li>a. he used a tree branch</li><li>b. he used a bare line with a tight knot</li><li>c. he used a sharp hook</li><li>d. he used an electronic rod to weigh fish</li></ul></li><li class='answer-the-questions-textarea' value='George dared the fisherman to prove his skill.'>What did George dare the fisherman to do? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>b</li><li class='answer-key'>d</li><li class='answer-key'>a</li><li class='answer-key'>d</li><li class='answer-key'>George dared the fisherman to prove his skill.</li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "Osiris and the Nile",
            "story": "<p>Long ago, Osiris was the king of Egypt, and Isis was the queen. They ruled the <strong class='idiom-tip' idx='7'>fertile </strong>land by the Nile River. They had great <strong class='idiom-tip' idx='12'>intelligence</strong>, and they shared their <strong class='idiom-tip' idx='0'>abstract </strong>ideas with everyone. Osiris taught the Egyptians how to make <strong class='idiom-tip' idx='19'>wheels </strong>and <strong class='idiom-tip' idx='9'>furniture</strong>. Isis taught them how to make things from <strong class='idiom-tip' idx='2'>clay </strong>and <strong class='idiom-tip' idx='3'>cloth</strong>. The people thought they <strong class='idiom-tip' idx='5'>deserved </strong>a gift. So they built Osiris and Isis a pyramid. Everyone loved Osiris except his brother, Set. Set wanted to be king.</p><p>Osiris made his <strong class='idiom-tip' idx='1'>annual </strong>trip around Egypt and led <strong class='idiom-tip' idx='15'>religious </strong>events. The villages gave him beautiful <strong class='idiom-tip' idx='17'>shells </strong>and colorful <strong class='idiom-tip' idx='6'>feathers </strong>as gifts.</p><p>When Osiris returned, Set brought a beautiful wooden box from behind a <strong class='idiom-tip' idx='4'>curtain</strong>.</p><p>&ldquo;If someone fits inside this box, I will give it to him or her,&rdquo; Set said.</p><p>Osiris got in it. It was an <strong class='idiom-tip' idx='11'>ideal </strong>fit!</p><p>Suddenly, Set closed the box and threw it into the river. &ldquo;Now I will be king!&rdquo; Set said.</p><p>The box washed up on a foreign <strong class='idiom-tip' idx='18'>shore </strong>after a <strong class='idiom-tip' idx='8'>flood</strong>. Isis brought his body home and <strong class='idiom-tip' idx='14'>obtained </strong>a <strong class='idiom-tip' idx='10'>grave </strong>for him in Egypt. The Egyptian gods thought Isis had done something very <strong class='idiom-tip' idx='16'>romantic</strong>. Because of her love, the gods made him the god of the underworld. Osiris returned every spring to help the farmers. Even <strong class='idiom-tip' idx='13'>nowadays</strong>, people say Osiris keeps their crops alive.</p>",
            "vi": "<p>Ngày xưa, Osiris là vua của Ai Cập, và Isis là hoàng hậu. Họ cai trị vùng đất <strong class='idiom-tip' idx='7'>màu mỡ</strong> bên dòng sông Nile. Họ có trí <strong class='idiom-tip' idx='12'>thông minh</strong> lớn, và họ chia sẻ những ý tưởng <strong class='idiom-tip' idx='0'>trừu tượng</strong> của mình với mọi người. Osiris dạy người Ai Cập cách làm <strong class='idiom-tip' idx='19'>bánh xe</strong> và <strong class='idiom-tip' idx='9'>đồ nội thất</strong>. Isis dạy họ cách làm những món đồ từ <strong class='idiom-tip' idx='2'>đất sét</strong> và <strong class='idiom-tip' idx='3'>vải</strong>. Người dân nghĩ rằng họ <strong class='idiom-tip' idx='5'>xứng đáng</strong> được tặng quà. Vì vậy, họ đã xây cho Osiris và Isis một kim tự tháp. Mọi người đều yêu quý Osiris, ngoại trừ em trai ông, Set. Set muốn trở thành vua.</p><p>Osiris thực hiện chuyến đi <strong class='idiom-tip' idx='1'>hàng năm</strong> vòng quanh Ai Cập và dẫn dắt các sự kiện <strong class='idiom-tip' idx='15'>tôn giáo</strong>. Các làng tặng ông những <strong class='idiom-tip' idx='17'>vỏ sò</strong> đẹp và những <strong class='idiom-tip' idx='6'>lông vũ</strong> đầy màu sắc như quà.</p><p>Khi Osiris trở về, Set mang đến một cái hộp gỗ đẹp từ sau một <strong class='idiom-tip' idx='4'>bức màn</strong>.</p><p>“Nếu ai vừa vặn trong cái hộp này, tôi sẽ tặng nó cho người đó,” Set nói.</p><p>Osiris bước vào. Nó vừa <strong class='idiom-tip' idx='11'>hoàn hảo</strong>!</p><p>Đột nhiên, Set đóng hộp lại và ném nó xuống sông. “Bây giờ tôi sẽ là vua!” Set nói.</p><p>Cái hộp trôi dạt đến một <strong class='idiom-tip' idx='18'>bờ biển</strong> xa lạ sau một <strong class='idiom-tip' idx='8'>cơn lũ</strong>. Isis mang thi thể của ông về nhà và <strong class='idiom-tip' idx='14'>đặt</strong> một <strong class='idiom-tip' idx='10'>mộ</strong> cho ông ở Ai Cập. Các vị thần Ai Cập nghĩ rằng Isis đã làm một điều gì đó rất <strong class='idiom-tip' idx='16'>lãng mạn</strong>. Vì tình yêu của cô, các vị thần đã biến ông thành thần của thế giới ngầm. Osiris trở lại mỗi mùa xuân để giúp đỡ nông dân. Ngay cả <strong class='idiom-tip' idx='13'>ngày nay</strong>, người ta vẫn nói rằng Osiris giữ cho mùa màng của họ xanh tươi.</p>",
            "image": "25847.jpg",
            "sound": "25847.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='2'>What is this story about?<ul class='ul-choose-answer'><li>a. Why Osiris built a pyramid for Isis  </li><li>b. How Set created a grave for Osiris </li><li>c. How Osiris died and returned to make Egypt fertile </li><li>d. Why the gods thought Isis’ actions were romantic</li></ul></li><li class='answer-the-questions-section' answer-index='3'>What happened each spring?<ul class='ul-choose-answer'><li>a. Osiris gave people feathers and shells. </li><li>b. Set obtained furniture from people. </li><li>c. Set hid a box behind a curtain.</li><li>d. Osiris made an annual trip to villages.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>In the last paragraph, we can infer that __________. <ul class='ul-choose-answer'><li>a. the shore is the ideal home for Osiris  </li><li>b. Set had greater intelligence than the gods  </li><li>c. the gods felt that Isis did a good deed </li><li>d. nowadays, the Egyptians don’t use Osiris’ abstract ideas</li></ul></li><li class='answer-the-questions-section' answer-index='3'>According to the passage, all the following are true EXCEPT __________.<ul class='ul-choose-answer'><li>a. the Egyptians made wheels </li><li>b. the Egyptians used clay pots </li><li>c. the Egyptians made cloth </li><li>d. the Egyptians built religious villages</li></ul></li><li class='answer-the-questions-textarea' value='The people built Osiris and Isis a pyramid.'>What did the Egyptians do for their king and queen? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>c</li><li class='answer-key'>d</li><li class='answer-key'>c</li><li class='answer-key'>d</li><li class='answer-key'>The people built Osiris and Isis a pyramid.  </li></ol>",
            "vi": ""
        }
    ],
    [
        {
            "type": "story",
            "en": "The Taxi Driver",
            "story": "<p>Peter&rsquo;s job was driving a taxi <strong class='idiom-tip' idx='4'>downtown</strong>. He made a small <strong class='idiom-tip' idx='15'>salary</strong>. But he liked his job because it wasn&rsquo;t <strong class='idiom-tip' idx='5'>dull</strong>. Every day, he saw new things that <strong class='idiom-tip' idx='0'>appealed </strong>to him. Peter was <strong class='idiom-tip' idx='13'>practical </strong>about the future. &ldquo;Maybe I can get a <strong class='idiom-tip' idx='16'>scholarship </strong>to college,&rdquo; he thought. &ldquo;I could learn mathematical <strong class='idiom-tip' idx='9'>formulas </strong>and get a job at a bank. I could help clients <strong class='idiom-tip' idx='11'>invest </strong>their money.&rdquo;</p><p>Peter stopped to pick up a passenger. &ldquo;Where to?&rdquo; he asked.</p><p>&ldquo;Go to the Fourth Street Bank. And don&rsquo;t talk to me. I&rsquo;ve had a rough day,&rdquo; the man said. Peter was angry, but he had a peaceful philosophy. When they stopped, the man&rsquo;s <strong class='idiom-tip' idx='7'>fare </strong>came to $10.25. He put his hands in his pockets. &ldquo;I can&rsquo;t find my wallet!&rdquo; he said. &ldquo;I can&rsquo;t pay the fare!&rdquo;</p><p>Peter said, &ldquo;Maybe I&rsquo;ll give you a <strong class='idiom-tip' idx='17'>temporary</strong> <strong class='idiom-tip' idx='12'>loan</strong>. You can <strong class='idiom-tip' idx='2'>borrow </strong>ten dollars and a <strong class='idiom-tip' idx='14'>quarter </strong>from me.&rdquo;</p><p>The man was <strong class='idiom-tip' idx='6'>embarrassed</strong>, saying, &ldquo;I was mean to you, but now I want to help you. I <strong class='idiom-tip' idx='10'>founded </strong>this bank. I want to give you one thousand dollars.&rdquo;</p><p>That much money was like a <strong class='idiom-tip' idx='18'>treasure </strong>to Peter. The man <strong class='idiom-tip' idx='19'>urged </strong>him to take the money, but he didn&rsquo;t.</p><p>&ldquo;You&rsquo;re an honest person,&rdquo; the man said. &ldquo;I <strong class='idiom-tip' idx='1'>assumed </strong>you would take it. I want you to work for me.&rdquo;</p><p>The next day, Peter started his job at the bank. He was happy to be done with his <strong class='idiom-tip' idx='8'>former </strong>job.</p>",
            "vi": "<p>Công việc của Peter là lái taxi <strong class='idiom-tip' idx='4'>vào trung tâm thành phố</strong>. Anh nhận một <strong class='idiom-tip' idx='15'>mức lương</strong> nhỏ. Nhưng anh thích công việc của mình vì nó không <strong class='idiom-tip' idx='5'>buồn tẻ</strong>. Mỗi ngày, anh thấy những điều mới lạ <strong class='idiom-tip' idx='0'>hấp dẫn</strong> anh. Peter có một cái nhìn <strong class='idiom-tip' idx='13'>thực tế</strong> về tương lai. “Có thể tôi có thể nhận được một <strong class='idiom-tip' idx='16'>học bổng</strong> vào đại học,” anh nghĩ. “Tôi có thể học các <strong class='idiom-tip' idx='9'>công thức toán học</strong> và có được một công việc ở ngân hàng. Tôi có thể giúp khách hàng <strong class='idiom-tip' idx='11'>đầu tư</strong> tiền của họ.”</p><p>Peter dừng lại để đón một hành khách. “Đi đâu?” anh hỏi.</p><p>“Đến Ngân hàng Fourth Street. Và đừng nói chuyện với tôi. Tôi đã có một ngày tồi tệ,” người đàn ông nói. Peter cảm thấy tức giận, nhưng anh có một triết lý yên bình. Khi họ dừng lại, <strong class='idiom-tip' idx='7'>tiền cước</strong> của người đàn ông là $10.25. Anh cho tay vào túi. “Tôi không tìm thấy ví của mình!” anh nói. “Tôi không thể trả tiền cước!”</p><p>Peter nói, “Có lẽ tôi sẽ cho bạn một <strong class='idiom-tip' idx='17'>khoản vay tạm thời</strong>. Bạn có thể <strong class='idiom-tip' idx='2'>mượn</strong> mười đô la và một <strong class='idiom-tip' idx='14'>phần tư</strong> từ tôi.”</p><p>Người đàn ông cảm thấy <strong class='idiom-tip' idx='6'>xấu hổ</strong>, nói, “Tôi đã cư xử không tốt với bạn, nhưng giờ tôi muốn giúp bạn. Tôi <strong class='idiom-tip' idx='10'>thành lập</strong> ngân hàng này. Tôi muốn tặng bạn một ngàn đô la.”</p><p>Số tiền đó đối với Peter như một <strong class='idiom-tip' idx='18'>kho báu</strong>. Người đàn ông <strong class='idiom-tip' idx='19'>thúc giục</strong> anh nhận số tiền, nhưng anh không nhận.</p><p>“Bạn là một người trung thực,” người đàn ông nói. “Tôi <strong class='idiom-tip' idx='1'>cho rằng</strong> bạn sẽ nhận nó. Tôi muốn bạn làm việc cho tôi.”</p><p>Ngày hôm sau, Peter bắt đầu công việc mới ở ngân hàng. Anh rất vui khi rời khỏi công việc <strong class='idiom-tip' idx='8'>trước đây</strong> của mình.</p>",
            "image": "25874.jpg",
            "sound": "25874.mp3"
        },
        {
            "type": "faq",
            "en": "Reading Comprehension",
            "story": "<h4>Answer the questions.</h4><ol><li class='answer-the-questions-section' answer-index='0'>What is this story about?<ul class='ul-choose-answer'><li>a. How a poor taxi driver got a new job by being kind</li><li>b. Why a dull job with a high salary appeals to people</li><li>c. How to get a scholarship to go to college</li><li>d. Why it is important not to borrow money</li></ul></li><li class='answer-the-questions-section' answer-index='0'>What does Peter do downtown?<ul class='ul-choose-answer'><li>a. He drives a taxi.</li><li>b. He studies math formulas.</li><li>c. He grumbles about his job.</li><li>d. He drives people around for a quarter.</li></ul></li><li class='answer-the-questions-section' answer-index='2'>Why does the man give Peter a job?<ul class='ul-choose-answer'><li>a. He assumes that Peter is practical.</li><li>b. He didn&rsquo;t want to give Peter a treasure.</li><li>c. Peter showed that he was honest.</li><li>d. Peter loaned him twenty five cents.</li></ul></li><li class='answer-the-questions-section' answer-index='3'>Why does Peter like his job?<ul class='ul-choose-answer'><li>a. He invested a lot of money in it.</li><li>b. It is only a temporary job.</li><li>c. He can embarrass other people by being rude.</li><li>d. It is never dull and he meets many people.</li></ul></li><li class='answer-the-questions-textarea' value='He urged Peter to take the money.'>What does the man urge Peter to do? <br />__________</li></ol>",
            "vi": ""
        },
        {
            "en": "Answer Key",
            "story": "<div class='answer-key-only'>Reading Comprehension</div><ol><li class='answer-key'>a</li><li class='answer-key'>a</li><li class='answer-key'>c</li><li class='answer-key'>d</li><li class='answer-key'>He urged Peter to take the money.</li></ol>",
            "vi": ""
        }
    ]
]